{
    "meta_data": {
        "bookId": "13",
        "title": "Aesops Fables",
        "authors": [
            "Aesop",
            "Laura Gibbs"
        ],
        "selfLink": "books\\Aesop;Laura Gibbs\\Aesops Fables\\",
        "thumbnail": "books\\Aesop;Laura Gibbs\\Aesops Fables\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "30 May 2020 22:55:22",
            "text": "‘be like the onager: don’t envy the fat donkeys!’ or ‘be like the fox: watch out for those lions!’\n"
        },
        {
            "time": "30 May 2020 23:06:08",
            "text": "And thenne the foxe beganne to lawhe and to scorne hym | and sayd to hym | O mayster goote | yf thow haddest be wel wyse with thy fayre berde | or euer thow haddest entryd in to the welle | thow sholdest fyrst haue taken hede | how thow sholdest haue comen oute of hit ageyne.\n"
        },
        {
            "time": "4 June 2020 15:03:09",
            "text": "‘Therefore there is no rychesse gretter than lyberte | For lyberte is better than alle the gold of the world.’\n"
        },
        {
            "time": "4 June 2020 15:06:06",
            "text": "The story shows that people who are obstinate and insubordinate come to a bad end because they get carried away by their own\n"
        },
        {
            "time": "4 June 2020 15:17:42",
            "text": "The Wolf, the Fox, and the Lion Dividing the Spoils The lion, the wolf, and the fox agreed to go hunting together. The fox caught a goose, the wolf caught a fat ram, and the lion caught a scrawny cow. Then it was time to eat. The lion told the wolf to divide their catch. The wolf said, ‘Let each one take what he has caught: the lion will take the cow, I’ll take the ram, and the fox will take the goose.’ The lion was enraged and, raising his paw, he used his claws to strip the wolf’s head of all its fur and skin. The lion then ordered the fox to divide the spoils. The fox said, ‘My lord, you should eat as much of the fat ram as you want, since its meat is tender, then you should eat as much of the goose as you want, but you should eat the cow’s flesh only in moderation, since it is so tough. Whatever is left over you can give to us, your servants.’ ‘Well done,’ said the lion. ‘Who taught you how to do such a good job of dividing the spoils?’ The fox said, ‘My lord, I have learned from my associate’s red cap: his excoriated skull provides a very vivid lesson.’\n"
        }
    ]
}