{
    "meta_data": {
        "bookId": "2",
        "title": "How to Read a Book",
        "authors": [
            "Van Doren, Charles",
            "Mortimer J Adler"
        ],
        "selfLink": "books\\Van Doren, Charles;Mortimer J Adler\\How to Read a Book\\",
        "thumbnail": "books\\Van Doren, Charles;Mortimer J Adler\\How to Read a Book\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "14 April 2020 21:58:17",
            "text": "the desideratum must be the ability to read different things at different—appropriate—speeds, not everything at the greatest possible speed.\n"
        },
        {
            "time": "14 April 2020 21:58:30",
            "text": "“When we read too fast or too slowly, we understand nothing.”\n"
        },
        {
            "time": "14 April 2020 22:05:54",
            "text": "But knowledge is not as much a prerequisite to understanding as is commonly supposed. We do not have to know everything about something in order to understand it; too many facts are often as much of an obstacle to understanding as too few.\n"
        },
        {
            "time": "14 April 2020 22:07:15",
            "text": "One of the reasons for this situation is that the very media we have mentioned are so designed as to make thinking seem unnecessary (though this is only an appearance). The packaging of intellectual positions and views is one of the most active enterprises of some of the best minds of our day. The viewer of television, the listener to radio, the reader of magazines, is presented with a whole complex of elements—all the way from ingenious rhetoric to carefully selected data and statistics—to make it easy for him to “make up his own mind” with the minimum of difficulty and effort. But the packaging is often done so effectively that the viewer, listener, or reader does not make up his own mind at all. Instead, he inserts a packaged opinion into his mind, somewhat like inserting a cassette into a cassette player. He then pushes a button and “plays back” the opinion whenever it seems appropriate to do so. He has performed acceptably without having had to think.\n"
        },
        {
            "time": "14 April 2020 22:09:39",
            "text": "Though, strictly speaking, there can be no absolutely passive reading, many people think that, as compared with writing and speaking, which are obviously active undertakings, reading and listening are entirely passive. The writer or speaker must put out some effort, but no work need be done by the reader or listener. Reading and listening are thought of as receiving communication from someone who is actively engaged in giving or sending it.\n"
        },
        {
            "time": "14 April 2020 22:11:14",
            "text": "Successful communication occurs in any case where what the writer wanted to have received finds its way into the reader’s possession. The writer’s skill and the reader’s skill converge upon a common end.\n"
        },
        {
            "time": "14 April 2020 22:12:50",
            "text": "The Goals of Reading: Reading for Information and Reading for Understanding\n"
        },
        {
            "time": "14 April 2020 22:13:26",
            "text": "Your success in reading it is determined by the extent to which you receive everything the writer intended to communicate.\n"
        },
        {
            "time": "15 April 2020 07:44:20",
            "text": "by the art of reading as follows: the process whereby a mind, with nothing to operate on but the symbols of the readable matter, and with no help from outside,I elevates itself by the power of its own operations. The mind passes from understanding less to understanding more. The skilled operations that cause this to happen are the various acts that constitute the art of reading.\n"
        },
        {
            "time": "15 April 2020 07:47:26",
            "text": "Here by “learning” is meant understanding more, not remembering more information that has the same degree of intelligibility as other information you already possess.\n"
        },
        {
            "time": "15 April 2020 07:49:21",
            "text": "In short, we can learn only from our “betters.” We must know who they are and how to learn from them.\n"
        },
        {
            "time": "15 April 2020 07:50:44",
            "text": "(This proposition cannot be reversed: it is not true that every book that can be read for entertainment can also be read for understanding.)\n"
        },
        {
            "time": "15 April 2020 07:52:27",
            "text": "To be informed is to know simply that something is the case. To be enlightened is to know, in addition, what it is all about: why it is the case, what its connections are with other facts, in what respects it is the same, in what respects it is different, and so forth.\n"
        },
        {
            "time": "15 April 2020 07:54:07",
            "text": "Enlightenment is achieved only when, in addition to knowing what an author says, you know what he means and why he says it.\n"
        },
        {
            "time": "15 April 2020 07:54:22",
            "text": "It is true, of course, that you should be able to remember what the author said as well as know what he meant. Being informed is prerequisite to being enlightened. The point, however, is not to stop at being informed.\n"
        },
        {
            "time": "15 April 2020 07:55:31",
            "text": "Montaigne speaks of “an abecedarian ignorance that precedes knowledge, and a doctoral ignorance that comes after it.” The first is the ignorance of those who, not knowing their ABC’s, cannot read at all. The second is the ignorance of those who have misread many books. They are, as Alexander Pope rightly calls them, bookful blockheads, ignorantly read.\n"
        },
        {
            "time": "15 April 2020 07:56:26",
            "text": "To avoid this error—the error of assuming that to be widely read and to be well-read are the same thing—we must consider a certain distinction in types of learning. This distinction has a significant bearing on the whole business of reading and its relation to education generally.\n"
        },
        {
            "time": "15 April 2020 07:57:08",
            "text": "In the history of education, men have often distinguished between learning by instruction and learning by discovery. Instruction occurs when one person teaches another through speech or writing. We can, however, gain knowledge without being taught. If this were not the case, and every teacher had to be taught what he in turn teaches others, there would be no beginning in the acquisition of knowledge. Hence, there must be discovery—the process of learning something by research, by investigation, or by reflection, without being taught.\n"
        },
        {
            "time": "15 April 2020 07:58:45",
            "text": "Similarly, although the teacher may help his student in many ways, it is the student himself who must do the learning.\n"
        },
        {
            "time": "15 April 2020 07:59:12",
            "text": "Similarly, although the teacher may help his student in many ways, it is the student himself who must do the learning. Knowledge must grow in his mind if learning is to take place.\n"
        },
        {
            "time": "15 April 2020 08:01:51",
            "text": "The reason why many people regard thinking as more closely associated with research and unaided discovery than with being taught is that they suppose reading and listening to be relatively effortless.\n"
        },
        {
            "time": "15 April 2020 08:04:58",
            "text": "The reason why many people regard thinking as more closely associated with research and unaided discovery than with being taught is that they suppose reading and listening to be relatively effortless. It is probably true that one does less thinking when one reads for information or entertainment than when one is undertaking to discover something. Those are the less active sorts of reading. But it is not true of the more active reading—the effort to understand. No one who has done this sort of reading would say it can be done thoughtlessly.\n"
        },
        {
            "time": "15 April 2020 08:06:23",
            "text": "The art of reading, in short, includes all of the same skills that are involved in the art of unaided discovery: keenness of observation, readily available memory, range of imagination, and, of course, an intellect trained in analysis and reflection. The reason for this is that reading in this sense is discovery, too—although with help instead of without it.\n"
        },
        {
            "time": "15 April 2020 08:07:40",
            "text": "If you ask a living teacher a question, he will probably answer you. If you are puzzled by what he says, you can save yourself the trouble of thinking by asking him what he means. If, however, you ask a book a question, you must answer it yourself.\n"
        },
        {
            "time": "15 April 2020 08:07:53",
            "text": "If you ask a living teacher a question, he will probably answer you. If you are puzzled by what he says, you can save yourself the trouble of thinking by asking him what he means. If, however, you ask a book a question, you must answer it yourself. In this respect a book is like nature or the world. When you question it, it answers you only to the extent that you do the work of thinking and analysis yourself.\n"
        },
        {
            "time": "15 April 2020 08:12:27",
            "text": "Perhaps we know more about the world than we used to, and insofar as knowledge is prerequisite to understanding, that is all to the good. But knowledge is not as much a prerequisite to understanding as is commonly supposed. We do not have to know everything about something in order to understand it; too many facts are often as much of an obstacle to understanding as too few.\n"
        },
        {
            "time": "15 April 2020 08:28:41",
            "text": "given the same thing to read, one person reads it better than another, first, by reading it more actively, and second, by performing each of the acts involved more skillfully.\n"
        },
        {
            "time": "15 April 2020 08:41:16",
            "text": "We do not want to give the impression that facts, leading to increased information, and insights, leading to increased understanding, are always easy to distinguish.\n"
        },
        {
            "time": "15 April 2020 09:24:16",
            "text": "The goal a reader seeks—be it entertainment, information or understanding—determines the way he reads. The effectiveness with which he reads is determined by the amount of effort and skill he puts into his reading. In general, the rule is: the more effort the better, at least in the case of books that are initially beyond our powers as readers and are therefore capable of raising us from a condition of understanding less to one of understanding more. Finally, the distinction between instruction and discovery (or between aided and unaided discovery) is important because most of us, most of the time, have to read without anyone to help us. Reading, like unaided discovery, is learning from an absent teacher. We can only do that successfully if we know how.\n"
        },
        {
            "time": "15 April 2020 09:30:22",
            "text": "They are thus faced with the task of achieving a superficial knowledge of the book at the same time that they are trying to understand it. That compounds the difficulty.\n"
        },
        {
            "time": "15 April 2020 09:30:47",
            "text": "most people, even many quite good readers, are unaware of the value of inspectional reading. They start a book on page one and plow steadily through it, without even reading the table of contents. They are thus faced with the task of achieving a superficial knowledge of the book at the same time that they are trying to understand it. That compounds the difficulty.\n"
        },
        {
            "time": "15 April 2020 09:32:10",
            "text": "“some books are to be tasted, others to be swallowed, and some few to be chewed and digested.”\n"
        },
        {
            "time": "15 April 2020 09:32:30",
            "text": "Francis Bacon once remarked that “some books are to be tasted, others to be swallowed, and some few to be chewed and digested.” Reading a book analytically is chewing and digesting it.\n"
        },
        {
            "time": "15 April 2020 09:43:21",
            "text": "Reading readiness includes several different kinds of preparation for learning to read. Physical readiness involves good vision and hearing. Intellectual readiness involves a minimum level of visual perception such that the child can take in and remember an entire word and the letters that combine to form it. Language readiness involves the ability to speak clearly and to use several sentences in correct order. Personal readiness involves the ability to work with other children, to sustain attention, to follow directions, and the like.\n"
        }
    ]
}