{
    "meta_data": {
        "bookId": "7",
        "title": "Goodbye, Things",
        "authors": [
            "Fumio Sasaki"
        ],
        "selfLink": "books\\Fumio Sasaki\\Goodbye, Things\\",
        "thumbnail": "books\\Fumio Sasaki\\Goodbye, Things\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "10 May 2020 09:08:18",
            "text": "“The things you own end up owning you.”\n"
        },
        {
            "time": "10 May 2020 09:33:35",
            "text": "Let go of “someday.” Things we don’t need now will probably never be needed.\n"
        },
        {
            "time": "10 May 2020 09:50:45",
            "text": "you would probably agree that it’s wiser to get rid of stocks if they continue to fall with no prospects of a rebound.\n"
        },
        {
            "time": "10 May 2020 10:09:05",
            "text": "There is a sense of wonder to things that we truly value.\n"
        },
        {
            "time": "10 May 2020 10:09:52",
            "text": "“If I were to somehow lose this, would I want to buy it again at full price?”\n"
        },
        {
            "time": "10 May 2020 10:12:08",
            "text": "This is what he wrote in his book Motanai otoko (The Man Who Doesn’t Possess): “I don’t think there’s any relationship between our past and photographs, records, and diaries. Even if we were to throw away photos and records that are filled with memorable moments, the past continues to exist in our memories. I don’t think it’s such a big deal to throw away objects; it isn’t as if we’re throwing away our past. If we forget a certain memory, then it’s probably something that’s all right for us to forget, something unnecessary. All the important memories that we have inside us will naturally remain.”\n"
        },
        {
            "time": "10 May 2020 10:15:35",
            "text": "In a thought-provoking documentary film called My Stuff, the protagonist takes all of his belongings, puts them in storage, and allows himself to retrieve only one item each day. On the first day, he really does have nothing on him; he runs to his storage unit wearing nothing but a newspaper to hide his private parts. He retrieves a coat on the first day and sleeps on the hard floor.\n"
        },
        {
            "time": "10 May 2020 10:18:37",
            "text": "By saying “See you later,” you put some distance between you and your possessions, which will allow you to think about their true meaning to you.\n"
        },
        {
            "time": "10 May 2020 10:19:30",
            "text": "This is one of the golden rules of minimizing: If you want to buy something, first get rid of something else.\n"
        },
        {
            "time": "10 May 2020 10:24:25",
            "text": "“If it’s not a ‘hell, yes!’ it’s a ‘no.’\n"
        },
        {
            "time": "10 May 2020 10:28:31",
            "text": "Your time is limited, so don’t waste it living someone else’s life.\n"
        },
        {
            "time": "10 May 2020 10:31:03",
            "text": "Recent studies in neuroscience have revealed that there are certain areas in our brain that are active only when we’re daydreaming or when our minds are wandering. These moments are said to be used for self-awareness, orientation, and memory—or to put it simply, to think about ourselves. A relaxed moment is not without meaning; it’s an important time for reflection. Maybe we’re sitting at a beach and listening to the sounds of the waves or gazing into a campfire.\n"
        },
        {
            "time": "10 May 2020 10:31:14",
            "text": "Science has proven that these types of relaxed intervals are necessary for us.\n"
        },
        {
            "time": "10 May 2020 10:31:23",
            "text": "Science has proven that these types of relaxed intervals are necessary for us. Whether we’re rich or poor, we all get twenty-four hours in a day. Finding time to relax is the ultimate luxury.\n"
        },
        {
            "time": "10 May 2020 10:31:50",
            "text": "My life itself was become my amusement and never ceased to be novel. It was a drama of many scenes and without an end.\n"
        },
        {
            "time": "10 May 2020 10:32:35",
            "text": "“We are what we repeatedly do. Excellence, then, is not an act but a habit.”\n"
        },
        {
            "time": "10 May 2020 10:37:52",
            "text": "It’s only after we’ve lost everything that we’re free to do anything.\n"
        },
        {
            "time": "10 May 2020 10:41:36",
            "text": "When you realize there is nothing lacking, the whole world belongs to you.\n"
        },
        {
            "time": "10 May 2020 10:47:13",
            "text": "a considerable amount of imagination is necessary if you want to compare your yoga class to someone else’s game of golf, or your\n"
        },
        {
            "time": "10 May 2020 10:50:25",
            "text": "Whatever you do will be insignificant, but it is very important that you do it.\n"
        },
        {
            "time": "10 May 2020 10:53:00",
            "text": "I’d rather regret something I’ve done than something I wish I had done\n"
        },
        {
            "time": "10 May 2020 10:54:40",
            "text": "The regret we experience for not doing something leaves a much stronger impression on us than the regret we may have for doing something. In psychology, this is called the Zeigarnik effect, which says that people remember things that they once pursued and left incomplete more than they do the things that they had completed.\n"
        },
        {
            "time": "10 May 2020 10:55:03",
            "text": "The lesson is clear: if there’s something you want to do, now’s the time to do it, whether it ends in success or failure.\n"
        },
        {
            "time": "10 May 2020 10:55:16",
            "text": "That’s why I wrote this book. I may regret it later. But I’m sure I would have regretted not doing it more. Overall, taking action leads to happiness.\n"
        },
        {
            "time": "10 May 2020 10:56:12",
            "text": "I’m as proud of what we don’t do as I am of what we do.\n"
        },
        {
            "time": "10 May 2020 10:57:46",
            "text": "People often say that a person who has a messy desk isn’t very productive, and I think the silent to-do list is the reason why. When a desk is cluttered with unorganized business cards, papers that need to be filed, and reference materials that need to be thrown away, it’s essentially a huge silent to-do-list pile that saps our concentration. It’ll take forever to find things in that pile, and while we’re searching through the clutter for the real to-do list that we need to focus on, we lose track of our priorities. At that point, the pile becomes overwhelming, our self-respect plummets, the stress builds up, and we escape to our smartphone or go on the Internet and check out some social media—we’re trapped in a vicious circle.\n"
        },
        {
            "time": "10 May 2020 10:58:01",
            "text": "The only way to focus on the important things is to reduce the things that aren’t important.\n"
        },
        {
            "time": "10 May 2020 11:00:09",
            "text": "I’ve heard that Apple respected ideas more than it did processes, which follows the same principle. In many companies, a designer could come up with a fantastic concept but it would eventually be watered down as it went through marketing, advertising, sales, and so on. Jobs despised such processes and did away with them. He believed that the more signatures you need to approve a product, the more boring the idea is going to become, and the more time it’s going to take for it to become a finished product.\n"
        },
        {
            "time": "10 May 2020 11:00:52",
            "text": "Psychologist Mihaly Csikszentmihalyi studied a state of happiness, triggered by concentration, that he called flow. When people are completely involved in something, they’re not only able to forget their problems, they actually lose track of the passing of time. With further concentration, even the notion of ego or self can disappear. They begin to feel a sense of contentment and the joy of living. The key to flow is the sense of contentment with the passing of time. The consumption of an engrossing movie or TV series may mask the passing of time, but it doesn’t lead to a state of flow. Csikszentmihalyi’s example is the performance of music, but really if you’ve ever been so immersed in doing something complicated that you’ve forgotten everything else, you’ve probably been in a state of flow.\n"
        },
        {
            "time": "10 May 2020 11:02:18",
            "text": "You may have heard the term “junk information” before. We might see something on the web that seems to grab our attention at first, only to later realize that there hadn’t been much meaning to it—if we haven’t already forgotten all about it, that is. Consuming too much junk information will lead to a state of “information metabolic syndrome.” Tests have shown that people flooded with excess amounts of information performed worse on brain tests than when they smoked marijuana.\n"
        },
        {
            "time": "10 May 2020 11:03:59",
            "text": "Many minimalists meditate and practice Zen or yoga, which is quite natural when you think about it. When you decrease the number of material possessions that you have, you become less distracted by your surroundings and your awareness naturally shifts inward.\n"
        },
        {
            "time": "10 May 2020 11:04:39",
            "text": "Various thoughts go through your mind when you meditate. You focus on those thoughts and concentrate on simply breathing. Your power of concentration starts to improve, making it second nature, even when you aren’t meditating. You learn to grasp and direct your train of thought. For me, Zen and meditation have improved my state of mind so much it’s as if I were reinstalling my personal operating system.\n"
        },
        {
            "time": "17 May 2020 22:20:32",
            "text": "My interpersonal relationships are deeper. The value of a man should be seen in what he gives and not in what he is able to receive. —ALBERT EINSTEIN\n"
        },
        {
            "time": "17 May 2020 22:20:55",
            "text": "I have a favorite book series by the Arbinger Institute that talks about how you can step out of your own little box. Put simply, it explains how personal relationships get disturbed and how they can be put back on track.\n"
        },
        {
            "time": "17 May 2020 22:22:44",
            "text": "Deeper relationships are only possible if we see every person as a real human being with the same meaningful desires, concerns, and fears. With more time and less stress, we can stop betraying our urges and take actions for the good of others. We can begin to see people as people instead of objects.\n"
        },
        {
            "time": "17 May 2020 22:24:13",
            "text": "I’ve heard it said that the secret to a happy marriage is to simply talk a lot with your partner.\n"
        },
        {
            "time": "17 May 2020 22:25:11",
            "text": "“Happiness [is] only real when shared.”\n"
        },
        {
            "time": "17 May 2020 22:28:00",
            "text": "There are only two ways to live your life. One is as though nothing is a miracle. The other is as though everything is. —attributed to ALBERT EINSTEIN\n"
        },
        {
            "time": "17 May 2020 22:28:39",
            "text": "Reflect upon how the food has come before you—how the food might have been grown, how it was prepared, and how it was brought to you as your meal. 2.  Reflect upon your virtues and conduct. Are you worthy of the meal? 3.  Focus only on the meal in front of you without rushing through it and without thinking any other thoughts. 4.  Eat not from a gourmet perspective, weighing whether the meal is tasty, but simply to support your life. 5.  Eat so you are able to pursue the objectives that you would like to achieve. It’s a powerful chant. Saying the chant before a thousand meals will give you a richer, more satisfying feeling than eating a $500 meal at a restaurant a thousand times. Steve Jobs is said to have looked in the mirror each morning and asked himself if he would have liked to follow his schedule if it were the last day of his life. He continued to do this for thirty-three years, so he could check whether he was getting off track. The Five Reflections are another way of checking our conduct on a daily basis. I’m no longer a gourmet foodie. Please don’t\n"
        },
        {
            "time": "17 May 2020 22:28:45",
            "text": "Reflect upon how the food has come before you—how the food might have been grown, how it was prepared, and how it was brought to you as your meal. 2.  Reflect upon your virtues and conduct. Are you worthy of the meal? 3.  Focus only on the meal in front of you without rushing through it and without thinking any other thoughts. 4.  Eat not from a gourmet perspective, weighing whether the meal is tasty, but simply to support your life. 5.  Eat so you are able to pursue the objectives that you would like to achieve.\n"
        },
        {
            "time": "18 May 2020 07:40:57",
            "text": "Positive psychology, a branch of psychology aimed at studying satisfaction and fulfillment, reveals a completely different model for happiness. Psychologist Sonja Lyubomirsky says that 50 percent of our happiness is genetically determined, 10 percent by life circumstances and situations, and the remaining 40 percent by our daily actions. “Life circumstances and situations” includes various factors, such as where we live, whether we’re rich or poor, healthy or ill, married or divorced, and so forth.\n"
        }
    ]
}