{
    "meta_data": {
        "bookId": "14",
        "title": "B00AO3K00I",
        "authors": [
            "Maria Konnikova"
        ],
        "selfLink": "books\\Maria Konnikova\\B00AO3K00I\\",
        "thumbnail": "books\\Maria Konnikova\\B00AO3K00I\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "3 June 2020 08:02:08",
            "text": "“Tell me to what you pay attention, and I will tell you who you are.”\n"
        },
        {
            "time": "3 June 2020 08:08:37",
            "text": "William James, the father of modern psychology, wrote that “the faculty of voluntarily bringing back a wandering attention, over and over again, is the very root of judgment, character, and will. . . . An education which should improve this faculty would be the education par excellence.”\n"
        },
        {
            "time": "3 June 2020 09:35:50",
            "text": "Richard Feynman\n"
        },
        {
            "time": "3 June 2020 09:37:16",
            "text": "The scientific method begins with a broad base of knowledge, an understanding of the facts and contours of the problem you are trying to tackle.\n"
        },
        {
            "time": "3 June 2020 09:40:10",
            "text": "That, in a nutshell, is the scientific method: understand and frame the problem; observe; hypothesize (or imagine); test and deduce; and repeat.\n"
        },
        {
            "time": "3 June 2020 10:23:19",
            "text": "Most psychologists now agree that our minds operate on a so-called two-system basis. One system is fast, intuitive, reactionary—a kind of constant fight-or-flight vigilance of the mind. It doesn’t require much conscious thought or effort and functions as a sort of status quo auto pilot. The other is slower, more deliberative, more thorough, more logical—but also much more cognitively costly. It likes to sit things out as long as it can and doesn’t step in unless it thinks it absolutely necessary.\n"
        },
        {
            "time": "3 June 2020 10:26:00",
            "text": "Benedict de Spinoza was the first to conceive of this necessity of acceptance for comprehension, and, writing a hundred years before Gilbert, William James explained the principle as “All propositions, whether attributive or existential, are believed through the very fact of being conceived.” Only after the conception do we effortfully engage in disbelieving something—and, as Gilbert points out, that part of the process can be far from automatic.\n"
        },
        {
            "time": "3 June 2020 10:29:43",
            "text": "In other words, begin with a healthy dose of skepticism instead of the credulity that is your mind’s natural state of being. Don’t just assume anything is the way it is. Think of everything as being as absurd as an animal that can’t possibly exist in nature. It’s a difficult proposition, especially to take on all at once—after all, it’s the same thing as asking your\n"
        },
        {
            "time": "3 June 2020 10:30:14",
            "text": "In fact, not only do we believe everything we hear, at least initially, but even when we have been told explicitly that a statement is false before we hear it, we are likely to treat it as true.\n"
        },
        {
            "time": "3 June 2020 10:31:24",
            "text": "In other words, begin with a healthy dose of skepticism instead of the credulity that is your mind’s natural state of being. Don’t just assume anything is the way it is. Think of everything as being as absurd as an animal that can’t possibly exist in nature. It’s a difficult proposition, especially to take on all at once—after all, it’s the same thing as asking your brain to go from its natural resting state to a mode of constant physical activity, expending important energy even where it would normally yawn, say okay, and move on to the next thing—but not an impossible one, especially if you’ve got Sherlock Holmes on your side. For he, perhaps better than anyone else, can serve as a trusty companion, an ever-present model for how to accomplish what may look at first glance like a herculean task.\n"
        },
        {
            "time": "4 June 2020 13:16:55",
            "text": "Children who have a so-called “rage to master”—a term coined by Ellen Winner to describe the intrinsic motivation to master a specific domain—are more likely to be successful in any number of endeavors, from art to science. If we are motivated to learn a language, we are more likely to succeed in our quest. Indeed, when we learn anything new, we learn better if we are motivated learners. Even our memory knows if we’re motivated or not: we remember better if we were motivated at the time the memory was formed. It’s called motivated encoding.\n"
        },
        {
            "time": "4 June 2020 13:17:11",
            "text": "And then, of course, there is that final piece of the puzzle: practice, practice, practice.\n"
        }
    ]
}