{
    "meta_data": {
        "bookId": "1",
        "title": "Sapiens",
        "authors": [
            "Yuval Noah Harari"
        ],
        "selfLink": "books\\Yuval Noah Harari\\Sapiens\\",
        "thumbnail": "books\\Yuval Noah Harari\\Sapiens\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "14 April 2020 10:08:16",
            "text": "matriarchs who had already seen it all. These archaic humans loved, played, formed close friendships and\n"
        },
        {
            "time": "14 April 2020 10:12:23",
            "text": "Just 6 million years ago, a single female ape had two daughters. One became the ancestor of all chimpanzees, the other is our own grandmother.\n"
        },
        {
            "time": "14 April 2020 16:23:41",
            "text": "years after their appearance, matter and energy started to coalesce\n"
        },
        {
            "time": "14 April 2020 16:45:16",
            "text": "dictates of society and weary elders who just wanted to be left\n"
        },
        {
            "time": "22 April 2020 18:41:25",
            "text": "They were too familiar to ignore, but too different to tolerate.\n"
        },
        {
            "time": "22 April 2020 19:09:42",
            "text": "out in fees. Yet none\n"
        },
        {
            "time": "22 April 2020 19:10:06",
            "text": "Yet none of these things exists outside the stories that people invent and tell one another. There are no gods in the universe, no nations, no money, no human rights, no laws, and no justice outside the common imagination of human beings.\n"
        },
        {
            "time": "22 April 2020 19:17:43",
            "text": "Telling effective stories is not easy. The difficulty lies not in telling the story, but in convincing everyone else to believe it. Much of history revolves around this question: how does one convince millions of people to believe particular stories about gods, or nations, or limited liability companies? Yet when it succeeds, it gives Sapiens immense power, because it enables millions of strangers to cooperate and work towards common goals. Just try to imagine how difficult it would have been to create states, or churches, or legal systems if we could speak only about things that really exist, such as rivers, trees and lions.\n"
        },
        {
            "time": "22 April 2020 19:19:16",
            "text": "Unlike lying, an imagined reality is something that everyone believes in, and as long as this communal belief persists, the imagined reality exerts force in the world.\n"
        },
        {
            "time": "22 April 2020 19:20:29",
            "text": "Ever since the Cognitive Revolution, Sapiens have thus been living in a dual reality. On the one hand, the objective reality of rivers, trees and lions; and on the other hand, the imagined reality of gods, nations and corporations. As time went by, the imagined reality became ever more powerful, so that today the very survival of rivers, trees and lions depends on the grace of imagined entities such as the United States and Google.\n"
        },
        {
            "time": "22 April 2020 21:50:17",
            "text": "The immense diversity of imagined realities that Sapiens invented, and the resulting diversity of behaviour patterns, are the main components of what we call ‘cultures’. Once cultures appeared, they never ceased to change and develop, and these unstoppable alterations are what we call ‘history’.\n"
        },
        {
            "time": "23 April 2020 09:53:53",
            "text": "There is some evidence that the size of the average Sapiens brain has actually decreased since the age of foraging.5 Survival in that era required superb mental abilities from everyone. When agriculture and industry came along people could increasingly rely on the skills of others for survival, and new ‘niches for imbeciles’ were opened up. You could survive and pass your unremarkable genes to the next generation by working as a water carrier or an assembly-line worker.\n"
        },
        {
            "time": "23 April 2020 18:36:19",
            "text": "every coprolite (the technical name for fossilised turds)\n"
        },
        {
            "time": "23 April 2020 19:24:06",
            "text": "themselves, and the farmyard animals that serve as galley\n"
        },
        {
            "time": "23 April 2020 19:27:30",
            "text": "animal has been domesticated in the last 2,000 years. If our minds are those of hunter-gatherers, our cuisine is that of ancient farmers.\n"
        },
        {
            "time": "23 April 2020 19:27:45",
            "text": "If our minds are those of hunter-gatherers, our cuisine is that of ancient farmers.\n"
        },
        {
            "time": "23 April 2020 19:33:11",
            "text": "plants\n"
        },
        {
            "time": "23 April 2020 19:33:25",
            "text": "plants domesticated\n"
        },
        {
            "time": "23 April 2020 19:33:44",
            "text": "Who was responsible? Neither kings, nor priests, nor merchants. The culprits were a handful of plant species, including wheat, rice and potatoes. These plants domesticated Homo sapiens, rather than vice versa.\n"
        },
        {
            "time": "23 April 2020 19:35:26",
            "text": "Wheat did it by manipulating Homo sapiens to its advantage. This ape had been living a fairly comfortable life hunting and gathering until about 10,000 years ago, but then began to invest more and more effort in cultivating wheat. Within a couple of millennia, humans in many parts of the world were doing little from dawn to dusk other than taking care of wheat plants. It wasn’t easy. Wheat demanded a lot of them. Wheat didn’t like rocks and pebbles, so Sapiens broke their backs clearing fields. Wheat didn’t like sharing its space, water and nutrients with other plants, so men and women laboured long days weeding under the scorching sun. Wheat got sick, so Sapiens had to keep a watch out for worms and blight. Wheat was attacked by rabbits and locust swarms, so the farmers built fences and stood guard over the fields. Wheat was thirsty, so humans dug irrigation canals or lugged heavy buckets from the well to water it. Sapiens even collected animal faeces to nourish the ground in which wheat grew.\n"
        },
        {
            "time": "23 April 2020 20:41:22",
            "text": "This is the essence of the Agricultural Revolution: the ability to keep more people alive under worse conditions.\n"
        },
        {
            "time": "23 April 2020 20:48:51",
            "text": "Why did people make such a fateful miscalculation? For the same reason that people throughout history have miscalculated. People were unable to fathom the full consequences of their decisions. Whenever they decided to do a bit of extra work – say, to hoe the fields instead of scattering seeds on the surface – people thought, ‘Yes, we will have to work harder. But the harvest will be so bountiful! We won’t have to worry any more about lean years. Our children will never go to sleep hungry.’ It made sense. If you worked harder, you would have a better life. That was the plan.\n"
        },
        {
            "time": "23 April 2020 20:50:21",
            "text": "The pursuit of an easier life resulted in much hardship, and not for the last time. It happens to us today. How many young college graduates have taken demanding jobs in high-powered firms, vowing that they will work hard to earn money that will enable them to retire and pursue their real interests when they are thirty-five? But by the time they reach that age, they have large mortgages, children to school, houses in the suburbs that necessitate at least two cars per family, and a sense that life is not worth living without really good wine and expensive holidays abroad. What are they supposed to do, go back to digging up roots? No, they double their efforts and keep slaving away.\n"
        },
        {
            "time": "23 April 2020 20:56:16",
            "text": "Humanity’s search for an easier life released immense forces of change that transformed the world in ways nobody envisioned or wanted. Nobody plotted the Agricultural Revolution or sought human dependence on cereal cultivation. A series of trivial decisions aimed mostly at filling a few stomachs and gaining a little security had the cumulative effect of forcing ancient foragers to spend their days carrying water buckets under a scorching sun.\n"
        },
        {
            "time": "24 April 2020 08:05:12",
            "text": "Nevertheless, in the subsistence economy of hunting and gathering, there was an obvious limit to such long-term planning. Paradoxically, it saved foragers a lot of anxieties. There was no sense in worrying about things that they could not influence.\n"
        },
        {
            "time": "24 April 2020 15:28:30",
            "text": "Imagined orders are not evil conspiracies or useless mirages. Rather, they are the only way large numbers of humans can cooperate effectively.\n"
        },
        {
            "time": "24 April 2020 15:29:53",
            "text": "Voltaire said about God that ‘there is no God, but don’t tell that to my servant, lest he murder me at night’.\n"
        },
        {
            "time": "24 April 2020 15:32:50",
            "text": "Of all human collective activities, the one most difficult to organise is violence.\n"
        },
        {
            "time": "24 April 2020 17:50:57",
            "text": "because they are true believers in the myths of romantic\n"
        },
        {
            "time": "24 April 2020 17:58:55",
            "text": "There is no way out of the imagined order. When we break down our prison walls and run towards freedom, we are in fact running into the more spacious exercise yard of a bigger prison.\n"
        },
        {
            "time": "24 April 2020 18:48:30",
            "text": "script of computers. Science-fiction movies such as The Matrix\n"
        },
        {
            "time": "24 April 2020 19:05:25",
            "text": "The most important impact of script on human history is precisely this: it has gradually changed the way humans think and view the world. Free association and holistic thought have given way to compartmentalisation and bureaucracy.\n"
        },
        {
            "time": "24 April 2020 19:08:26",
            "text": "A person who wishes to influence the decisions of governments, organisations and companies must therefore learn to speak in numbers. Experts do their best to translate even ideas such as ‘poverty’, ‘happiness’ and ‘honesty’ into numbers (‘the poverty line’, ‘subjective well-being levels’, ‘credit rating’).\n"
        },
        {
            "time": "24 April 2020 19:08:44",
            "text": "An equation for calculating the acceleration of mass i under the influence of gravity, according to the Theory of Relativity. When most laypeople see such an equation, they usually panic and freeze, like a deer caught in the headlights of a speeding vehicle. The reaction is quite natural, and does not betray a lack of intelligence or curiosity. With rare exceptions, human brains are simply incapable of thinking through concepts like relativity and quantum mechanics. Physicists nevertheless manage to do so, because they set aside the traditional human way of thinking, and learn to think anew with the help of external data-processing systems. Crucial parts of their thought process take place not in the head, but inside computers or on classroom blackboards. A\n"
        },
        {
            "time": "24 April 2020 19:08:54",
            "text": "A person who wishes to influence the decisions of governments,\n"
        },
        {
            "time": "24 April 2020 19:09:02",
            "text": "A person who wishes to influence the decisions of governments, organisations and companies must therefore learn to speak in numbers. Experts do their best to translate even ideas such as ‘poverty’, ‘happiness’ and ‘honesty’ into numbers (‘the poverty line’, ‘subjective well-being levels’, ‘credit rating’). Entire fields of knowledge, such as physics and engineering, have already lost almost all touch with the spoken human language, and are maintained solely by mathematical script.\n"
        },
        {
            "time": "24 April 2020 19:11:13",
            "text": "The short answer is that humans created imagined orders and devised scripts. These two inventions filled the gaps left by our biological inheritance.\n"
        },
        {
            "time": "24 April 2020 19:16:04",
            "text": "Ask white supremacists about the racial hierarchy, and you are in for a pseudoscientific lecture concerning the biological differences between the races. You are likely to be told that there is something in Caucasian blood or genes that makes whites naturally more intelligent, moral and hardworking. Ask a diehard capitalist about the hierarchy of wealth, and you are likely to hear that it is the inevitable outcome of objective differences in abilities. The rich have more money, in this view, because they are more capable and diligent. No one should be bothered, then, if the wealthy get better health care, better education and better nutrition. The rich richly deserve every perk they enjoy.\n"
        },
        {
            "time": "24 April 2020 19:19:37",
            "text": "Most people claim that their social hierarchy is natural and just, while those of other societies are based on false and ridiculous criteria. Modern Westerners are taught to scoff at the idea of racial hierarchy. They are shocked by laws prohibiting blacks to live in white neighbourhoods, or to study in white schools, or to be treated in white hospitals. But the hierarchy of rich and poor – which mandates that rich people live in separate and more luxurious neighbourhoods, study in separate and more prestigious schools, and receive medical treatment in separate and better-equipped facilities – seems perfectly sensible to many Americans and Europeans. Yet it’s a proven fact that most rich people are rich for the simple reason that they were born into a rich family, while most poor people will remain poor throughout their lives simply because they were born into a poor family.\n"
        },
        {
            "time": "25 April 2020 07:51:04",
            "text": "Such vicious circles can go on for centuries and even millennia, perpetuating an imagined hierarchy that sprang from a chance historical occurrence. Unjust discrimination often gets worse, not better, with time. Money comes to money, and poverty to poverty. Education comes to education, and ignorance to ignorance. Those once victimised by history are likely to be victimised yet again. And those whom history has privileged are more likely to be privileged again.\n"
        },
        {
            "time": "25 April 2020 08:11:48",
            "text": "How can we distinguish what is biologically determined from what people merely try to justify through biological myths? A good rule of thumb is ‘Biology enables, Culture forbids.’ Biology is willing to tolerate a very wide spectrum of possibilities. It’s culture that obliges people to realise some possibilities while forbidding others. Biology enables women to have children – some cultures oblige women to realise this possibility. Biology enables men to enjoy sex with one another – some cultures forbid them to realise this possibility.\n"
        },
        {
            "time": "25 April 2020 08:15:54",
            "text": "The same sort of multitasking applies to our sexual organs and behaviour. Sex first evolved for procreation and courtship rituals as a way of sizing up the fitness of a potential mate. But many animals now put both to use for a multitude of social purposes that have little to do with creating little copies of themselves. Chimpanzees, for example, use sex to cement political alliances, establish intimacy and defuse tensions. Is that unnatural?\n"
        },
        {
            "time": "25 April 2020 09:00:30",
            "text": "Consistency is the playground of dull minds.\n"
        },
        {
            "time": "25 April 2020 09:00:41",
            "text": "Just as when two clashing musical notes played together force a piece of music forward, so discord in our thoughts, ideas and values compel us to think, re-evaluate and criticise. Consistency is the playground of dull minds.\n"
        },
        {
            "time": "25 April 2020 09:00:47",
            "text": "Just as medieval culture did not manage to square chivalry with Christianity, so the modern world fails to square liberty with equality. But this is no defect. Such contradictions are an inseparable part of every human culture. In fact, they are culture’s engines, responsible for the creativity and dynamism of our species. Just as when two clashing musical notes played together force a piece of music forward, so discord in our thoughts, ideas and values compel us to think, re-evaluate and criticise. Consistency is the playground of dull minds.\n"
        },
        {
            "time": "25 April 2020 09:01:55",
            "text": "Cognitive dissonance is often considered a failure of the human psyche. In fact, it is a vital asset. Had people been unable to hold contradictory beliefs and values, it would probably have been impossible to establish and maintain any human culture.\n"
        },
        {
            "time": "25 April 2020 11:19:11",
            "text": "money is the most universal and most efficient system of mutual trust ever devised.\n"
        },
        {
            "time": "25 April 2020 11:34:29",
            "text": "For thousands of years, philosophers, thinkers and prophets have besmirched money and called it the root of all evil. Be that as it may, money is also the apogee of human tolerance. Money is more open-minded than language, state laws, cultural codes, religious beliefs and social habits. Money is the only trust system created by humans that can bridge almost any cultural gap, and that does not discriminate on the basis of religion, gender, race, age or sexual orientation. Thanks to money, even people who don’t know each other and don’t trust each other can nevertheless cooperate effectively.\n"
        },
        {
            "time": "25 April 2020 19:54:13",
            "text": "wholeheartedly with the Arab Empire that conquered\n"
        },
        {
            "time": "26 April 2020 16:30:53",
            "text": "Many Americans nowadays maintain that their government has a moral imperative to bring Third World countries the benefits of democracy and human rights, even if these goods are delivered by cruise missiles and F-16s.\n"
        },
        {
            "time": "26 April 2020 16:34:54",
            "text": "In the late nineteenth century, many educated Indians were taught the same lesson by their British masters. One famous anecdote tells of an ambitious Indian who mastered the intricacies of the English language, took lessons in Western-style dance, and even became accustomed to eating with a knife and fork. Equipped with his new manners, he travelled to England, studied law at University College London, and became a qualified barrister. Yet this young man of law, bedecked in suit and tie, was thrown off a train in the British colony of South Africa for insisting on travelling first class instead of settling for third class, where ‘coloured’ men like him were supposed to ride. His name was Mohandas Karamchand Gandhi.\n"
        },
        {
            "time": "26 April 2020 16:50:59",
            "text": "Think, for example, about the love–hate relationship between the independent Indian republic of today and the British Raj. The British conquest and occupation of India cost the lives of millions of Indians, and was responsible for the continuous humiliation and exploitation of hundreds of millions more. Yet many Indians adopted, with the zest of converts, Western ideas such as self-determination and human rights, and were dismayed when the British refused to live up to their own declared values by granting native Indians either equal rights as British subjects or independence.\n"
        },
        {
            "time": "26 April 2020 16:52:23",
            "text": "Nevertheless, the modern Indian state is a child of the British Empire. The British killed, injured and persecuted the inhabitants of the subcontinent, but they also united a bewildering mosaic of warring kingdoms, principalities and tribes, creating a shared national consciousness and a country that functioned more or less as a single political unit. They laid the foundations of the Indian judicial system, created its administrative structure, and built the railroad network that was critical for economic integration. Independent India adopted Western democracy, in its British incarnation, as its form of government. English is still the subcontinent’s lingua franca, a neutral tongue that native speakers of Hindi, Tamil and Malayalam can use to communicate. Indians are passionate cricket players and chai (tea) drinkers, and both game and beverage are British legacies. Commercial tea farming did not exist in India until the mid-nineteenth century, when it was introduced by the British East India Company. It was the snobbish British sahibs who spread the custom of tea drinking throughout the subcontinent.\n"
        },
        {
            "time": "26 April 2020 17:06:09",
            "text": "Despite their ability to legitimise widespread social and political orders, not all religions have actuated this potential. In order to unite under its aegis a large expanse of territory inhabited by disparate groups of human beings, a religion must possess two further qualities. First, it must espouse a universal superhuman order that is true always and everywhere. Second, it must insist on spreading this belief to everyone. In other words, it must be universal and missionary.\n"
        },
        {
            "time": "26 April 2020 17:10:05",
            "text": "leading theory about the origin of the gods argues that gods gained importance because they offered a solution to this problem. Gods such as the fertility goddess, the sky god and the god of medicine took centre stage when plants and animals lost their ability to speak, and the gods’ main role was to mediate between humans and the mute plants and animals. Much of ancient mythology is in fact a legal contract in which humans promise everlasting devotion to the gods in exchange for mastery over plants and animals – the first chapters of the book of Genesis are a prime example.\n"
        },
        {
            "time": "26 April 2020 17:16:35",
            "text": "Atman is the eternal essence or soul of the entire universe, as well as of every individual and every phenomenon.\n"
        },
        {
            "time": "26 April 2020 17:16:41",
            "text": "In Hindu polytheism, a single principle, Atman, controls the myriad gods and spirits, humankind, and the biological and physical world. Atman is the eternal essence or soul of the entire universe, as well as of every individual and every phenomenon.\n"
        },
        {
            "time": "26 April 2020 17:17:17",
            "text": "The fundamental insight of polytheism, which distinguishes it from monotheism, is that the supreme power governing the world is devoid of interests and biases, and therefore it is unconcerned with the mundane desires, cares and worries of humans. It’s pointless to ask this power for victory in war, for health or for rain, because from its all-encompassing vantage point, it makes no difference whether a particular kingdom wins or loses, whether a particular city prospers or withers, whether a particular person recuperates or dies. The Greeks did not waste any sacrifices on Fate, and Hindus built no temples to Atman.\n"
        },
        {
            "time": "26 April 2020 17:58:23",
            "text": "Judaism, for example, argued that the supreme power of the universe has interests and biases, yet His chief interest is in the tiny Jewish nation and in the obscure land of Israel. Judaism had little to offer other nations, and throughout most of its existence it has not been a missionary religion. This stage can be called the stage of ‘local monotheism’.\n"
        },
        {
            "time": "26 April 2020 18:08:21",
            "text": "For dualists, it’s easy to explain evil. Bad things happen even to good people because the world is not governed single-handedly by a good God. There is an independent evil power loose in the world. The evil power does bad things.\n"
        },
        {
            "time": "26 April 2020 18:08:28",
            "text": "Dualism is a very attractive world view because it has a short and simple answer to the famous Problem of Evil, one of the fundamental concerns of human thought. ‘Why is there evil in the world? Why is there suffering? Why do bad things happen to good people?’ Monotheists have to practise intellectual gymnastics to explain how an all-knowing, all-powerful and perfectly good God allows so much suffering in the world. One well-known explanation is that this is God’s way of allowing for human free will. Were there no evil, humans could not choose between good and evil, and hence there would be no free will. This, however, is a non-intuitive answer that immediately raises a host of new questions. Freedom of will allows humans to choose evil. Many indeed choose evil and, according to the standard monotheist account, this choice must bring divine punishment in its wake. If God knew in advance that a particular person would use her free will to choose evil, and that as a result she would be punished for this by eternal tortures in hell, why did God create her? Theologians have written countless books to answer such questions. Some find the answers convincing. Some don’t. What’s undeniable is that monotheists have a hard time dealing with the Problem of Evil.\n"
        },
        {
            "time": "26 April 2020 18:09:34",
            "text": "So, monotheism explains order, but is mystified by evil. Dualism explains evil, but is puzzled by order. There is one logical way of solving the riddle: to argue that there is a single omnipotent God who created the entire universe – and He’s evil. But nobody in history has had the stomach for such a belief.\n"
        },
        {
            "time": "26 April 2020 18:14:45",
            "text": "independent Devil. Countless Christians, Muslims and Jews have gone so far as to imagine that the good God even needs our help in its struggle against the Devil, which inspired among other things the call for jihads and crusades.\n"
        },
        {
            "time": "26 April 2020 18:15:03",
            "text": "So it should not come as a surprise that millions of pious Christians, Muslims and Jews manage to believe at one and the same time in an omnipotent God and an independent Devil. Countless Christians, Muslims and Jews have gone so far as to imagine that the good God even needs our help in its struggle against the Devil, which inspired among other things the call for jihads and crusades.\n"
        },
        {
            "time": "26 April 2020 18:15:14",
            "text": "How can a monotheist adhere to such a dualistic belief (which, by the way, is nowhere to be found in the Old Testament)? Logically, it is impossible. Either you believe in a single omnipotent God or you believe in two opposing powers, neither of which is omnipotent. Still, humans have a wonderful capacity to believe in contradictions. So it should not come as a surprise that millions of pious Christians, Muslims and Jews manage to believe at one and the same time in an omnipotent God and an independent Devil. Countless Christians, Muslims and Jews have gone so far as to imagine that the good God even needs our help in its struggle against the Devil, which inspired among other things the call for jihads and crusades.\n"
        },
        {
            "time": "26 April 2020 18:15:51",
            "text": "Gnostics and Manichaeans argued that the good god created the spirit and the soul, whereas matter and bodies are the creation of the evil god. Man, according to this view, serves as a battleground between the good soul and the evil body.\n"
        },
        {
            "time": "26 April 2020 18:18:05",
            "text": "From a monotheistic perspective, this is nonsense – why distinguish so sharply between body and soul, or matter and spirit? And why argue that body and matter are evil? After all, everything was created by the same good God. But monotheists could not help but be captivated by dualist dichotomies, precisely because they helped them address the problem of evil. So such oppositions eventually became cornerstones of Christian and Muslim thought. Belief in heaven (the realm of the good god) and hell (the realm of the evil god) was also dualist in origin. There is no trace of this belief in the Old Testament, which also never claims that the souls of people continue to live after the death of the body.\n"
        },
        {
            "time": "26 April 2020 18:23:06",
            "text": "A prime example is Buddhism, the most important of the ancient natural law religions, which remains one of the major faiths.\n"
        },
        {
            "time": "26 April 2020 18:28:22",
            "text": "pleasures. Gautama found that there was a way to exit this vicious circle. If, when the mind experiences something pleasant or unpleasant, it simply understands things as they are, then there is no suffering\n"
        },
        {
            "time": "26 April 2020 18:29:36",
            "text": "But how do you get the mind to accept things as they are, without craving? To accept sadness as sadness, joy as joy, pain as pain? Gautama developed a set of meditation techniques that train the mind to experience reality as it is, without craving. These practices train the mind to focus all its attention on the question, ‘What am I experiencing now?’ rather than on ‘What would I rather be experiencing?’ It is difficult to achieve this state of mind, but not impossible.\n"
        },
        {
            "time": "26 April 2020 21:06:07",
            "text": "suffering arises from craving; the only way to be fully liberated from suffering is to be fully liberated from craving; and the only way to be liberated from craving is to train the mind to experience reality as it is.\n"
        },
        {
            "time": "26 April 2020 21:07:02",
            "text": "This law, known as dharma or dhamma, is seen by Buddhists as a universal law of nature. That ‘suffering arises from craving’ is always and everywhere true, just as in modern physics E always equals mc². Buddhists are people who believe in this law and make it the fulcrum of all their activities. Belief in gods, on the other hand, is of minor importance to them. The first principle of monotheist religions is ‘God exists. What does He want from me?’ The first principle of Buddhism is ‘Suffering exists. How do I escape it?’\n"
        },
        {
            "time": "26 April 2020 21:07:39",
            "text": "Buddhism does not deny the existence of gods – they are described as powerful beings who can bring rains and victories – but they have no influence on the law that suffering arises from craving. If the mind of a person is free of all craving, no god can make him miserable. Conversely, once craving arises in a person’s mind, all the gods in the universe cannot save him from suffering.\n"
        },
        {
            "time": "26 April 2020 21:17:52",
            "text": "Like liberal humanism, socialist humanism is built on monotheist foundations. The idea that all humans are equal is a revamped version of the monotheist conviction that all souls are equal before God\n"
        },
        {
            "time": "26 April 2020 21:48:58",
            "text": "What is the difference between describing ‘how’ and explaining ‘why’? To describe ‘how’ means to reconstruct the series of specific events that led from one point to another. To explain ‘why’ means to find causal connections that account for the occurrence of this particular series of events to the exclusion of all others.\n"
        },
        {
            "time": "26 April 2020 21:54:05",
            "text": "In AD 600, the notion that a band of desert-dwelling Arabs would soon conquer an expanse stretching from the Atlantic Ocean to India was even more preposterous. Indeed, had the Byzantine army been able to repel the initial onslaught, Islam would probably have remained an obscure cult of which only a handful of cognoscenti were aware. Scholars would then have a very easy job explaining why a faith based on a revelation to a middle-aged Meccan merchant could never have caught on.\n"
        },
        {
            "time": "26 April 2020 21:56:46",
            "text": "way they interact produce huge differences in outcomes. Not only that, but history is what is called a ‘level two’ chaotic system. Chaotic systems come in two shapes. Level one chaos is chaos that does not react to predictions about it. The weather, for example, is a level one chaotic system. Though it is influenced by myriad factors, we can build computer models that take more and more of them into consideration, and produce better and better weather forecasts. Level two chaos is chaos that reacts to predictions about it, and therefore can never be predicted accurately.\n"
        },
        {
            "time": "26 April 2020 21:59:02",
            "text": "So why study history? Unlike physics or economics, history is not a means for making accurate predictions. We study history not to know the future but to widen our horizons, to understand that our present situation is neither natural nor inevitable, and that we consequently have many more possibilities before us than we imagine. For example, studying how Europeans came to dominate Africans enables us to realise that there is nothing natural or inevitable about the racial hierarchy, and that the world might well be arranged differently.\n"
        },
        {
            "time": "27 April 2020 17:30:03",
            "text": "a Provision for the Widows and Children of the Ministers\n"
        },
        {
            "time": "27 April 2020 17:35:24",
            "text": "This approach is sometimes called memetics. It assumes that, just as organic evolution is based on the replication of organic information units called ‘genes’, so cultural evolution is based on the replication of cultural information units called ‘memes’.1 Successful cultures are those that excel in reproducing their memes, irrespective of the costs and benefits to their human hosts.\n"
        },
        {
            "time": "27 April 2020 17:37:00",
            "text": ", views and behaviour patterns that harm all players nevertheless manage to take root and spread\n"
        },
        {
            "time": "27 April 2020 17:37:09",
            "text": "Game theory explains how in multi-player systems, views and behaviour patterns that harm all players nevertheless manage to take root and spread\n"
        },
        {
            "time": "27 April 2020 17:38:03",
            "text": "No matter what you call it – game theory, postmodernism or memetics – the dynamics of history are not directed towards enhancing human well-being. There is no basis for thinking that the most successful cultures in history are necessarily the best ones for Homo sapiens. Like evolution, history disregards the happiness of individual organisms. And individual humans, for their part, are usually far too ignorant and weak to influence the course of history to their own advantage.\n"
        },
        {
            "time": "27 April 2020 17:48:55",
            "text": "The willingness to admit ignorance. Modern science is based on the Latin injunction ignoramus – ‘we do not know’. It assumes that we don’t know everything. Even more critically, it accepts that the things that we think we know could be proven wrong as we gain more knowledge. No concept,\n"
        },
        {
            "time": "27 April 2020 17:49:16",
            "text": "The centrality of observation and mathematics. Having admitted ignorance, modern science aims to obtain new knowledge. It does so by gathering observations and then using mathematical tools to connect these observations into comprehensive theories.\n"
        },
        {
            "time": "27 April 2020 17:49:25",
            "text": "The acquisition of new powers. Modern science is not content with creating theories. It uses these theories in order to acquire new powers, and in particular to develop new technologies.\n"
        },
        {
            "time": "27 April 2020 17:50:12",
            "text": "The Scientific Revolution has not been a revolution of knowledge. It has been above all a revolution of ignorance. The great discovery that launched the Scientific Revolution was the discovery that humans do not know the answers to their most important questions. Premodern traditions of knowledge such as Islam, Christianity, Buddhism and Confucianism asserted that everything that is important to know about the world was already known. The great gods, or the one almighty God, or the wise people of the past possessed all-encompassing wisdom, which they revealed to us in scriptures and oral traditions. Ordinary mortals gained knowledge by delving into these ancient texts and traditions and understanding them properly. It was inconceivable that the Bible, the Qur’an or the Vedas were missing out on a crucial secret of the universe – a secret that might yet be discovered by flesh-and-blood creatures.\n"
        },
        {
            "time": "27 April 2020 17:52:54",
            "text": "Modern-day science is a unique tradition of knowledge, inasmuch as it openly admits collective ignorance regarding the most important questions. Darwin never argued that he was ‘The Seal of the Biologists’, and that he had solved the riddle of life once and for all. After centuries of extensive scientific research, biologists admit that they still don’t have any good explanation for how brains produce consciousness. Physicists admit that they don’t know what caused the Big Bang, or how to reconcile quantum mechanics with the theory of general relativity.\n"
        },
        {
            "time": "27 April 2020 17:58:43",
            "text": "Of course, physicists analysing the spectra of distant galaxies, archaeologists analysing the finds from a Bronze Age city, and political scientists studying the emergence of capitalism do not disregard tradition. They start by studying what the wise people of the past have said and written. But from their first year in college, aspiring physicists, archaeologists and political scientists are taught that it is their mission to go beyond what Einstein, Heinrich Schliemann and Max Weber ever knew.\n"
        },
        {
            "time": "27 April 2020 18:00:11",
            "text": "This is exactly what scientists seek to accomplish. In 1687, Isaac Newton published The Mathematical Principles of Natural Philosophy, arguably the most important book in modern history. Newton presented a general theory of movement and change. The greatness of Newton’s theory was its ability to explain and predict the movements of all bodies in the universe, from falling apples to shooting stars, using three very simple mathematical laws:\n"
        },
        {
            "time": "27 April 2020 18:00:59",
            "text": "This is exactly what scientists seek to accomplish. In 1687, Isaac Newton published The Mathematical Principles of Natural Philosophy, arguably the most important book in modern history. Newton presented a general theory of movement and change. The greatness of Newton’s theory was its ability to explain and predict the movements of all bodies in the universe, from falling apples to shooting stars, using three very simple mathematical laws: Henceforth, anyone who wished to understand and predict the movement of a cannonball or a planet simply had to make measurements of the object’s mass, direction and acceleration, and the forces acting on it. By inserting these numbers into Newton’s equations, the future position of the object could be predicted.\n"
        },
        {
            "time": "27 April 2020 18:05:49",
            "text": "In 1744, two Presbyterian clergymen in Scotland, Alexander Webster and Robert Wallace, decided to set up a life-insurance fund that would provide pensions for the widows and orphans of dead clergymen. They proposed that each of their church’s ministers would pay a small portion of his income into the fund, which would invest the money. If a minister died, his widow would receive dividends on the fund’s profits. This would allow her to live comfortably for the rest of her life. But to determine how much the ministers had to pay in so that the fund would have enough money to live up to its obligations, Webster and Wallace had to be able to predict how many ministers would die each year, how many widows and orphans they would leave behind, and by how many years the widows would outlive their husbands. Take note of what the two churchmen did not do. They did not pray to God to reveal the answer. Nor did they search for an answer in the Holy Scriptures or among the works of ancient theologians. Nor did they enter into an abstract philosophical disputation. Being Scots, they were practical types. So they contacted a professor of mathematics from the University of Edinburgh, Colin Maclaurin. The three of them collected data on the ages at which people died and used these to calculate how many ministers were likely to pass away in any given year. Their work was founded on several recent breakthroughs in the fields of statistics and probability. One of these was Jacob Bernoulli’s Law of Large Numbers. Bernoulli had codified the principle that while it might be difficult to predict with certainty a single event, such as the death of a particular person, it was possible to predict with great accuracy the average outcome of many similar events. That is, while Maclaurin could not use maths to predict whether Webster and Wallace would die next year, he could, given enough data, tell Webster and Wallace how many Presbyterian ministers in Scotland would almost certainly die next year. Fortunately, they had ready-made data that they could use. Actuary tables published fifty years previously by Edmond Halley proved particularly useful. Halley had analysed records of 1,238 births and 1,174 deaths that he obtained from the city of Breslau, Germany. Halley’s tables made it possible to see that, for example, a twenty-year-old person has a 1:100 chance of dying in a given year, but a fifty-year-old person has a 1:39 chance. Processing these numbers, Webster and Wallace concluded that, on average, there would be 930 living Scottish Presbyterian ministers at any given moment, and an average of twenty-seven ministers would die each year, eighteen of whom would be survived by widows. Five of those who did not leave widows would leave orphaned children, and two of those survived by widows would also be outlived by children from previous marriages who had not yet reached the age of sixteen. They further computed how much time was likely to go by before the widows’ death or remarriage (in both these eventualities, payment of the pension would cease). These figures enabled Webster and Wallace to determine how much money the ministers who joined their fund had to pay in order to provide for their loved ones. By contributing £2 12s. 2d. a year, a minister could guarantee that his widowed wife would receive at least £10 a year – a hefty sum in those days. If he thought that was not enough he could choose to pay in more, up to a level of £6 11s. 3d. a year – which would guarantee his widow the even more handsome sum of £25 a year. According to their calculations, by the year 1765 the Fund for a Provision for the Widows and Children of the Ministers of the Church of Scotland would have capital totalling £58,348. Their calculations proved amazingly accurate.\n"
        },
        {
            "time": "27 April 2020 18:06:27",
            "text": "Scottish Widows\n"
        },
        {
            "time": "27 April 2020 18:08:43",
            "text": "Today few students study rhetoric; logic is restricted to philosophy departments, and theology to seminaries. But more and more students are motivated – or forced – to study mathematics. There is an irresistible drift towards the exact sciences – defined as ‘exact’ by their use of mathematical tools. Even fields of study that were traditionally part of the humanities, such as the study of human language (linguistics) and the human psyche (psychology), rely increasingly on mathematics and seek to present themselves as exact sciences. Statistics courses are now part of the basic requirements not just in physics and biology, but also in psychology, sociology, economics and political science.\n"
        },
        {
            "time": "27 April 2020 18:09:09",
            "text": "In the course catalogue of the psychology department at my own university, the first required course in the curriculum is ‘Introduction to Statistics and Methodology in Psychological Research’. Second-year psychology students must take ‘Statistical Methods in Psychological Research’. Confucius, Buddha, Jesus and Muhammad would have been bewildered if you told them that in order to understand the human mind and cure its illnesses you must first study statistics.\n"
        },
        {
            "time": "27 April 2020 18:20:09",
            "text": "Many faiths believed that some day a messiah would appear and end all wars, famines and even death itself. But the notion that humankind could do so by discovering new knowledge and inventing new tools was worse than ludicrous – it was hubris. The story of the Tower of Babel, the story of Icarus, the story of the Golem and countless other myths taught people that any attempt to go beyond human limitations would inevitably lead to disappointment and disaster.\n"
        },
        {
            "time": "27 April 2020 18:22:51",
            "text": "And indeed, many parts of the world have already been freed from the worst forms of deprivation. Throughout history, societies have suffered from two kinds of poverty: social poverty, which withholds from some people the opportunities available to others; and biological poverty, which puts the very lives of individuals at risk due to lack of food and shelter. Perhaps social poverty can never be eradicated, but in many countries around the world biological poverty is a thing of the past.\n"
        },
        {
            "time": "27 April 2020 18:25:39",
            "text": "That is the theme of the most ancient myth to come down to us – the Gilgamesh myth of ancient Sumer. Its hero is the strongest and most capable man in the world, King Gilgamesh of Uruk, who could defeat anyone in battle. One day, Gilgamesh’s best friend, Enkidu, died. Gilgamesh sat by the body and observed it for many days, until he saw a worm dropping out of his friend’s nostril. At that moment Gilgamesh was gripped by a terrible horror, and he resolved that he himself would never die. He would somehow find a way to defeat death. Gilgamesh then undertook a journey to the end of the universe, killing lions, battling scorpion-men and finding his way into the underworld. There he shattered the mysterious “stone things” of Urshanabi, the ferryman of the river of the dead, and found Utnapishtim, the last survivor of the primordial flood. Yet Gilgamesh failed in his quest. He returned home empty-handed, as mortal as ever, but with one new piece of wisdom. When the gods created man, Gilgamesh had learned, they set death as man’s inevitable destiny, and man must learn to live with\n"
        },
        {
            "time": "27 April 2020 18:32:24",
            "text": "How long will the Gilgamesh Project – the quest for immortality – take to complete? A hundred years? Five hundred years? A thousand years? When we recall how little we knew about the human body in 1900, and how much knowledge we have gained in a single century, there is cause for optimism. Genetic engineers have recently managed to double the average life expectancy of Caenorhabditis elegans worms.12 Could they do the same for Homo sapiens? Nanotechnology experts are developing a bionic immune system composed of millions of nano-robots, who would inhabit our bodies, open blocked blood vessels, fight viruses and bacteria, eliminate cancerous cells and even reverse ageing processes.13 A few serious scholars suggest that by 2050, some humans will become a-mortal (not immortal, because they could still die of some accident, but a-mortal, meaning that in the absence of fatal trauma their lives could be extended indefinitely).\n"
        },
        {
            "time": "27 April 2020 18:39:26",
            "text": "In short, scientific research can flourish only in alliance with some religion or ideology. The ideology justifies the costs of the research. In exchange, the ideology influences the scientific agenda and determines what to do with the discoveries. Hence in order to comprehend how humankind has reached Alamogordo and the moon – rather than any number of alternative destinations – it is not enough to survey the achievements of physicists, biologists and sociologists. We have to take into account the ideological, political and economic forces that shaped physics, biology and sociology, pushing them in certain directions while neglecting others.\n"
        },
        {
            "time": "27 April 2020 19:04:07",
            "text": "On 20 July 1969, Neil Armstrong and Buzz Aldrin landed on the surface of the moon. In the months leading up to their expedition, the Apollo II astronauts trained in a remote moon-like desert in the western United States. The area is home to several Native American communities, and there is a story – or legend – describing an encounter between the astronauts and one of the locals. One day as they were training, the astronauts came across an old Native American. The man asked them what they were doing there. They replied that they were part of a research expedition that would shortly travel to explore the moon. When the old man heard that, he fell silent for a few moments, and then asked the astronauts if they could do him a favour. ‘What do you want?’ they asked. ‘Well,’ said the old man, ‘the people of my tribe believe that holy spirits live on the moon. I was wondering if you could pass an important message to them from my people.’ ‘What’s the message?’ asked the astronauts. The man uttered something in his tribal language, and then asked the astronauts to repeat it again and again until they had memorised it correctly. ‘What does it mean?’ asked the astronauts. ‘Oh, I cannot tell you. It’s a secret that only our tribe and the moon spirits are allowed to know.’ When they returned to their base, the astronauts searched and searched until they found someone who could speak the tribal language, and asked him to translate the secret message. When they repeated what they had memorised, the translator started to laugh uproariously. When he calmed down, the astronauts asked him what it meant. The man explained that the sentence they had memorised so carefully said, ‘Don’t believe a single word these people are telling you. They have come to steal your lands.’\n"
        },
        {
            "time": "28 April 2020 07:30:36",
            "text": "Over the last 500 years the idea of progress convinced people to put more and more trust in the future. This trust created credit; credit brought real economic growth; and growth strengthened the trust in the future and opened the way for even more credit. It didn’t happen overnight – the economy behaved more like a roller coaster than a balloon. But over the long run, with the bumps evened out, the general direction was unmistakable. Today, there is so much credit in the world that governments, business corporations and private individuals easily obtain large, long-term and low-interest loans that far exceed current income.\n"
        },
        {
            "time": "28 April 2020 07:32:04",
            "text": "Egoism is altruism.\n"
        },
        {
            "time": "28 April 2020 07:33:36",
            "text": "‘The profits of production must be reinvested in increasing production.’\n"
        },
        {
            "time": "28 April 2020 07:38:48",
            "text": "Over the last few years, banks and governments have been frenziedly printing money. Everybody is terrified that the current economic crisis may stop the growth of the economy. So they are creating trillions of dollars, euros and yen out of thin air, pumping cheap credit into the system, and hoping that the scientists, technicians and engineers will manage to come up with something really big, before the bubble bursts. Everything depends on the people in the labs. New discoveries in fields such as biotechnology and nanotechnology could create entire new industries, whose profits could back the trillions of make-believe money that the banks and governments have created since 2008. If the labs do not fulfil these expectations before the bubble bursts, we are heading towards very rough times.\n"
        },
        {
            "time": "28 April 2020 16:08:04",
            "text": "In 1717 the Mississippi Company, chartered in France, set out to colonise the lower Mississippi valley, establishing the city of New Orleans in the process. To finance its ambitious plans, the company, which had good connections at the court of King Louis XV, sold shares on the Paris stock exchange. John Law, the company’s director, was also the governor of the central bank of France. Furthermore, the king had appointed him controller-general of finances, an office roughly equivalent to that of a modern finance minister. In 1717 the lower Mississippi valley offered few attractions besides swamps and alligators, yet the Mississippi Company spread tales of fabulous riches and boundless opportunities. French aristocrats, businessmen and the stolid members of the urban bourgeoisie fell for these fantasies, and Mississippi share prices skyrocketed. Initially, shares were offered at 500 livres apiece. On 1 August 1719, shares traded at 2,750 livres. By 30 August, they were worth 4,100 livres, and on 4 September, they reached 5,000 livres. On 2 December the price of a Mississippi share crossed the threshold of 10,000 livres. Euphoria swept the streets of Paris. People sold all their possessions and took huge loans in order to buy Mississippi shares. Everybody believed they’d discovered the easy way to riches.\n"
        },
        {
            "time": "28 April 2020 16:09:30",
            "text": "French Revolution.\n"
        },
        {
            "time": "28 April 2020 16:20:43",
            "text": "The most notorious example of how governments did the bidding of big money was the First Opium War, fought between Britain and China (1840–42). In the first half of the nineteenth century, the British East India Company and sundry British business people made fortunes by exporting drugs, particularly opium, to China. Millions of Chinese became addicts, debilitating the country both economically and socially. In the late 1830s the Chinese government issued a ban on drug trafficking, but British drug merchants simply ignored the law. Chinese authorities began to confiscate and destroy drug cargos. The drug cartels had close connections in Westminster and Downing Street – many MPs and Cabinet ministers in fact held stock in the drug companies – so they pressured the government to take action.\n"
        },
        {
            "time": "28 April 2020 16:29:26",
            "text": "This is why today a country’s credit rating is far more important to its economic well-being than are its natural resources. Credit ratings indicate the probability that a country will pay its debts. In addition to purely economic data, they take into account political, social and even cultural factors. An oil-rich country cursed with a despotic government, endemic warfare and a corrupt judicial system will usually receive a low credit rating. As a result, it is likely to remain relatively poor since it will not be able to raise the necessary capital to make the most of its oil bounty. A country devoid of natural resources, but which enjoys peace, a fair judicial system and a free government is likely to receive a high credit rating. As such, it may be able to raise enough cheap capital to support a good education system and foster a flourishing high-tech industry.\n"
        },
        {
            "time": "28 April 2020 16:31:09",
            "text": "Ardent capitalists tend to argue that capital should be free to influence politics, but politics should not be allowed to influence capital. They argue that when governments interfere in the markets, political interests cause them to make unwise investments that result in slower growth. For example, a government may impose heavy taxation on industrialists and use the money to give lavish unemployment benefits, which are popular with voters. In the view of many business people, it would be far better if the government left the money with them. They would use it, they claim, to open new factories and hire the unemployed.\n"
        },
        {
            "time": "28 April 2020 16:39:18",
            "text": "When the Europeans conquered America, they opened gold and silver mines and established sugar, tobacco and cotton plantations. These mines and plantations became the mainstay of American production and export. The sugar plantations were particularly important. In the Middle Ages, sugar was a rare luxury in Europe. It was imported from the Middle East at prohibitive prices and used sparingly as a secret ingredient in delicacies and snake-oil medicines. After large sugar plantations were established in America, ever-increasing amounts of sugar began to reach Europe. The price of sugar dropped and Europe developed an insatiable sweet tooth. Entrepreneurs met this need by producing huge quantities of sweets: cakes, cookies, chocolate, candy, and sweetened beverages such as cocoa, coffee and tea. The annual sugar intake of the average Englishman rose from near zero in the early seventeenth century to around eighteen pounds in the early nineteenth century. However, growing cane and extracting its sugar was a labour-intensive business. Few people wanted to work long hours in malaria-infested sugar fields under a tropical sun. Contract labourers would have produced a commodity too expensive for mass consumption. Sensitive to market forces, and greedy for profits and economic growth, European plantation owners switched to slaves. From the sixteenth to the nineteenth centuries, about 10 million African slaves were imported to America. About 70 per cent of them worked on the sugar plantations. Labour conditions were abominable. Most slaves lived a short and miserable life, and millions more died during wars waged to capture slaves or during the long voyage from inner Africa to the shores of America. All this so that Europeans could enjoy their sweet tea and candy – and sugar barons could enjoy huge profits.\n"
        },
        {
            "time": "29 April 2020 07:24:37",
            "text": "As in previous eras, there is today a division of labour between the elite and the masses. In medieval Europe, aristocrats spent their money carelessly on extravagant luxuries, whereas peasants lived frugally, minding every penny. Today, the tables have turned. The rich take great care managing their assets and investments, while the less well heeled go into debt buying cars and televisions they don’t really need.\n"
        },
        {
            "time": "29 April 2020 07:52:09",
            "text": "community.* Most people worked in the family business – the family farm or the family workshop, for example – or they worked in their\n"
        },
        {
            "time": "29 April 2020 08:04:16",
            "text": "Consumerism and nationalism work extra hours to make us imagine that millions of strangers belong to the same community as ourselves, that we all have a common past, common interests and a common future. This isn’t a lie. It’s imagination. Like money, limited liability companies and human rights, nations and consumer tribes are inter-subjective realities.\n"
        },
        {
            "time": "29 April 2020 08:07:39",
            "text": "In recent decades, national communities have been increasingly eclipsed by tribes of customers who do not know one another intimately but share the same consumption habits and interests, and therefore feel part of the same consumer tribe – and define themselves as such. This sounds very strange, but we are surrounded by examples. Madonna fans, for example, constitute a consumer tribe. They define themselves largely by shopping. They buy Madonna concert tickets, CDs, posters, shirts and ring tones, and thereby define who they are. Manchester United fans, vegetarians and environmentalists are other examples. They, too, are defined above all by what they consume. It is the keystone of their identity. A German vegetarian might well prefer to marry a French vegetarian than a German carnivore.\n"
        },
        {
            "time": "29 April 2020 08:18:35",
            "text": "At least some of the praise usually heaped on Mahatma Gandhi for his non-violent creed is actually owed to the British Empire.\n"
        },
        {
            "time": "29 April 2020 08:19:27",
            "text": "At least some of the praise usually heaped on Mahatma Gandhi for his non-violent creed is actually owed to the British Empire. Despite many years of bitter and often violent struggle, when the end of the Raj came, the Indians did not have to fight the British in the streets of Delhi and Calcutta. The empire’s place was taken by a slew of independent states, most of which have since enjoyed stable borders and have for the most part lived peacefully alongside their neighbours. True, tens of thousands of people perished at the hands of the threatened British Empire, and in several hot spots its retreat led to the eruption of ethnic conflicts that claimed hundreds of thousands of lives (particularly in India). Yet when compared to the long-term historical average, the British withdrawal was an exemplar of peace and order. The French Empire was more stubborn. Its collapse involved bloody rearguard actions in Vietnam and Algeria that cost hundreds of thousands of lives. Yet the French, too, retreated from the rest of their dominions quickly and peacefully, leaving behind orderly states rather than a chaotic free-for-all.\n"
        },
        {
            "time": "29 April 2020 08:28:11",
            "text": "There is a positive feedback loop between all these four factors. The threat of nuclear holocaust fosters pacifism; when pacifism spreads, war recedes and trade flourishes; and trade increases both the profits of peace and the costs of war. Over time, this feedback loop creates another obstacle to war, which may ultimately prove the most important of all. The tightening web of international connections erodes the independence of most countries, lessening the chance that any one of them might single-handedly let slip the dogs of war.\n"
        },
        {
            "time": "29 April 2020 08:29:09",
            "text": "or 1962, it would probably have been much more glum.\n"
        },
        {
            "time": "29 April 2020 08:41:16",
            "text": "The generally accepted definition of happiness is ‘subjective well-being’. Happiness, according to this view, is something I feel inside myself, a sense of either immediate pleasure or long-term contentment with the way my life is going. If it’s something felt inside, how can it be measured from outside? Presumably,\n"
        },
        {
            "time": "29 April 2020 08:41:23",
            "text": "The generally accepted definition of happiness is ‘subjective well-being’. Happiness, according to this view, is something I feel inside myself, a sense of either immediate pleasure or long-term contentment with the way my life is going. If it’s something felt inside, how can it be measured from outside? Presumably, we can do so by asking people to tell us how they feel. So psychologists or biologists who want to assess how happy people feel give them questionnaires to fill out and tally the results.\n"
        },
        {
            "time": "29 April 2020 08:46:57",
            "text": "Prophets, poets and philosophers realised thousands of years ago that being satisfied with what you already have is far more important than getting more of what you want. Still, it’s nice when modern research – bolstered by lots of numbers and charts – reaches the same conclusions the ancients did.\n"
        },
        {
            "time": "29 April 2020 08:47:38",
            "text": "The crucial importance of human expectations has far-reaching implications for understanding the history of happiness. If happiness depended only on objective conditions such as wealth, health and social relations, it would have been relatively easy to investigate its history. The finding that it depends on subjective expectations makes the task of historians far harder. We moderns have an arsenal of tranquillisers and painkillers at our disposal, but our expectations of ease and pleasure, and our intolerance of inconvenience and discomfort, have increased to such an extent that we may well suffer from pain more than our ancestors ever did. It’s hard to accept this line of thinking.\n"
        },
        {
            "time": "29 April 2020 08:50:49",
            "text": "If happiness is determined by expectations, then two pillars of our society – mass media and the advertising industry – may unwittingly be depleting the globe’s reservoirs of contentment. If you were an eighteen-year-old youth in a small village 5,000 years ago you’d probably think you were good-looking because there were only fifty other men in your village and most of them were either old, scarred and wrinkled, or still little kids. But if you are a teenager today you are a lot more likely to feel inadequate. Even if the other guys at school are an ugly lot, you don’t measure yourself against them but against the movie stars, athletes and supermodels you see all day on television, Facebook and giant billboards.\n"
        },
        {
            "time": "29 April 2020 08:57:58",
            "text": "Some air-conditioning systems are set at 70 degrees Fahrenheit. Others are set at twenty degrees. Human happiness conditioning systems also differ from person to person. On a scale from one to ten, some people are born with a cheerful biochemical system that allows their mood to swing between levels six and ten, stabilising with time at eight. Such a person is quite happy even if she lives in an alienating big city, loses all her money in a stock-exchange crash and is diagnosed with diabetes. Other people are cursed with a gloomy biochemistry that swings between three and seven and stabilises at five. Such an unhappy person remains depressed even if she enjoys the support of a tight-knit community, wins millions in the lottery and is as healthy as an Olympic athlete. Indeed, even if our gloomy friend wins $50,000,000 in the morning, discovers the cure for both AIDS and cancer by noon, makes peace between Israelis and Palestinians that afternoon, and then in the evening reunites with her long-lost child who disappeared years ago – she would still be incapable of experiencing anything beyond level seven happiness. Her brain is simply not built for exhilaration, come what may.\n"
        },
        {
            "time": "29 April 2020 09:01:31",
            "text": "In addition, most biologists are not fanatics. They maintain that happiness is determined mainly by biochemistry, but they agree that psychological and sociological factors also have their place. Our mental air-conditioning system has some freedom of movement within predetermined borders. It is almost impossible to exceed the upper and lower emotional boundaries, but marriage and divorce can have an impact in the area between the two. Somebody born with an average of level five happiness would never dance wildly in the streets. But a good marriage should enable her to enjoy level seven from time to time, and to avoid the despondency of level three.\n"
        },
        {
            "time": "29 April 2020 14:32:44",
            "text": "So perhaps happiness is synchronising one’s personal delusions of meaning with the prevailing collective delusions. As long as my personal narrative is in line with the narratives of the people around me, I can convince myself that my life is meaningful, and find happiness in that conviction.\n"
        },
        {
            "time": "29 April 2020 14:43:13",
            "text": "If happiness is based on feeling pleasant sensations, then in order to be happier we need to re-engineer our biochemical system. If happiness is based on feeling that life is meaningful, then in order to be happier we need to delude ourselves more effectively.\n"
        },
        {
            "time": "29 April 2020 14:44:06",
            "text": "ought to be and what ought not to be, are all determined by what\n"
        },
        {
            "time": "29 April 2020 14:44:14",
            "text": "Liberal politics is based on the idea that the voters know best, and there is no need for Big Brother to tell us what is good for us. Liberal economics is based on the idea that the customer is always right. Liberal art declares that beauty is in the eye of the beholder. Students in liberal schools and universities are taught to think for themselves.\n"
        },
        {
            "time": "29 April 2020 14:44:35",
            "text": "Liberal politics is based on the idea that the voters know best, and there is no need for Big Brother to tell us what is good for us. Liberal economics is based on the idea that the customer is always right. Liberal art declares that beauty is in the eye of the beholder. Students in liberal schools and universities are taught to think for themselves. Commercials urge us to ‘Just do it!’ Action films, stage dramas, soap operas, novels and catchy pop songs indoctrinate us constantly: ‘Be true to yourself’, ‘Listen to yourself’, ‘Follow your heart’. Jean-Jacques Rousseau stated this view most classically: ‘What I feel to be good – is good. What I feel to be bad – is bad.’\n"
        },
        {
            "time": "30 April 2020 08:24:49",
            "text": "According to Buddhism, most people identify happiness with pleasant feelings, while identifying suffering with unpleasant feelings. People consequently ascribe immense importance to what they feel, craving to experience more and more pleasures, while avoiding pain. Whatever we do throughout our lives, whether scratching our leg, fidgeting slightly in the chair, or fighting world wars, we are just trying to get pleasant feelings.\n"
        },
        {
            "time": "30 April 2020 08:25:21",
            "text": "The problem, according to Buddhism, is that our feelings are no more than fleeting vibrations, changing every moment, like the ocean waves. If five minutes ago I felt joyful and purposeful, now these feelings are gone, and I might well feel sad and dejected. So if I want to experience pleasant feelings, I have to constantly chase them, while driving away the unpleasant feelings. Even if I succeed, I immediately have to start all over again, without ever getting any lasting reward for my troubles.\n"
        },
        {
            "time": "30 April 2020 08:25:59",
            "text": "The problem, according to Buddhism, is that our feelings are no more than fleeting vibrations, changing every moment, like the ocean waves. If five minutes ago I felt joyful and purposeful, now these feelings are gone, and I might well feel sad and dejected. So if I want to experience pleasant feelings, I have to constantly chase them, while driving away the unpleasant feelings. Even if I succeed, I immediately have to start all over again, without ever getting any lasting reward for my troubles. What is so important about obtaining such ephemeral prizes? Why struggle so hard to achieve something that disappears almost as soon as it arises? According to Buddhism, the root of suffering is neither the feeling of pain nor of sadness nor even of meaninglessness. Rather, the real root of suffering is this never-ending and pointless pursuit of ephemeral feelings, which causes us to be in a constant state of tension, restlessness and dissatisfaction. Due to this pursuit, the mind is never satisfied. Even when experiencing pleasure, it is not content, because it fears this feeling might soon disappear, and craves that this feeling should stay and intensify.\n"
        },
        {
            "time": "30 April 2020 08:26:48",
            "text": "experience this or that fleeting pleasure, but rather when they understand the impermanent nature of all their feelings, and stop craving them. This is the aim of Buddhist meditation practices. In meditation, you are supposed to closely observe your mind and body, witness the ceaseless arising and passing of all your feelings, and realise how pointless it is to pursue them. When the pursuit stops, the mind becomes very relaxed, clear and satisfied. All kinds of feelings go on arising and passing – joy, anger, boredom, lust – but once you stop craving particular feelings, you can just accept them for what they are. You live in the present moment instead of fantasising about what might have been.\n"
        },
        {
            "time": "30 April 2020 08:26:52",
            "text": "The problem, according to Buddhism, is that our feelings are no more than fleeting vibrations, changing every moment, like the ocean waves. If five minutes ago I felt joyful and purposeful, now these feelings are gone, and I might well feel sad and dejected. So if I want to experience pleasant feelings, I have to constantly chase them, while driving away the unpleasant feelings. Even if I succeed, I immediately have to start all over again, without ever getting any lasting reward for my troubles. What is so important about obtaining such ephemeral prizes? Why struggle so hard to achieve something that disappears almost as soon as it arises? According to Buddhism, the root of suffering is neither the feeling of pain nor of sadness nor even of meaninglessness. Rather, the real root of suffering is this never-ending and pointless pursuit of ephemeral feelings, which causes us to be in a constant state of tension, restlessness and dissatisfaction. Due to this pursuit, the mind is never satisfied. Even when experiencing pleasure, it is not content, because it fears this feeling might soon disappear, and craves that this feeling should stay and intensify. People are liberated from suffering not when they experience this or that fleeting pleasure, but rather when they understand the impermanent nature of all their feelings, and stop craving them. This is the aim of Buddhist meditation practices. In meditation, you are supposed to closely observe your mind and body, witness the ceaseless arising and passing of all your feelings, and realise how pointless it is to pursue them. When the pursuit stops, the mind becomes very relaxed, clear and satisfied. All kinds of feelings go on arising and passing – joy, anger, boredom, lust – but once you stop craving particular feelings, you can just accept them for what they are. You live in the present moment instead of fantasising about what might have been.\n"
        },
        {
            "time": "30 April 2020 08:27:27",
            "text": "The resulting serenity is so profound that those who spend their lives in the frenzied pursuit of pleasant feelings can hardly imagine it. It is like a man standing for decades on the seashore, embracing certain ‘good’ waves and trying to prevent them from disintegrating, while simultaneously pushing back ‘bad’ waves to prevent them from getting near him. Day in, day out, the man stands on the beach, driving himself crazy with this fruitless exercise. Eventually, he sits down on the sand and just allows the waves to come and go as they please. How peaceful!\n"
        },
        {
            "time": "30 April 2020 08:28:32",
            "text": "Buddha agreed with modern biology and New Age movements that happiness is independent of external conditions. Yet his more important and far more profound insight was that true happiness is also independent of our inner feelings. Indeed, the more significance we give our feelings, the more we crave them, and the more we suffer. Buddha’s recommendation was to stop not only the pursuit of external achievements, but also the pursuit of inner feelings.\n"
        },
        {
            "time": "30 April 2020 08:29:48",
            "text": "If this is so, then our entire understanding of the history of happiness might be misguided. Maybe it isn’t so important whether people’s expectations are fulfilled and whether they enjoy pleasant feelings. The main question is whether people know the truth about themselves.\n"
        },
        {
            "time": "30 April 2020 08:37:31",
            "text": "future. At the time of writing, the replacement of natural selection by intelligent design could happen in any of three ways: through biological engineering, cyborg engineering (cyborgs are beings that combine organic with non-organic parts) or the engineering of inorganic life. Of Mice and Men Biological engineering is deliberate human intervention on the biological level (e.g. implanting a gene) aimed at modifying an organism’s shape, capabilities, needs or desires, in order to realise some preconceived cultural idea, such as the artistic predilections of Eduardo Kac.\n"
        },
        {
            "time": "30 April 2020 08:37:51",
            "text": "It is impossible to explain the existence of Alba through the laws of natural selection. She is the product of intelligent design. She is also a harbinger of things to come. If the potential Alba signifies is realised in full – and if humankind doesn’t annihilate itself meanwhile – the Scientific Revolution might prove itself far greater than a mere historical revolution. It may turn out to be the most important biological revolution since the appearance of life on earth. After 4 billion years of natural selection, Alba stands at the dawn of a new cosmic era, in which life will be ruled by intelligent design. If this happens, the whole of human history up to that point might, with hindsight, be reinterpreted as a process of experimentation and apprenticeship that revolutionised the game of life. Such a process should be understood from a cosmic perspective of billions of years, rather than from a human perspective of millennia. Biologists the world over are locked in battle with the intelligent-design movement, which opposes the teaching of Darwinian evolution in schools and claims that biological complexity proves there must be a creator who thought out all biological details in advance. The biologists are right about the past, but the proponents of intelligent design might, ironically, be right about the future.\n"
        },
        {
            "time": "30 April 2020 08:38:06",
            "text": "At the time of writing, the replacement of natural selection by intelligent design could happen in any of three ways: through biological engineering, cyborg engineering (cyborgs are beings that combine organic with non-organic parts) or the engineering of inorganic life.\n"
        },
        {
            "time": "30 April 2020 09:10:05",
            "text": "If the curtain is indeed about to drop on Sapiens history, we members of one of its final generations should devote some time to answering one last question: what do we want to become? This question, sometimes known as the Human Enhancement question, dwarfs the debates that currently preoccupy politicians, philosophers, scholars and ordinary people. After all, today’s debate between today’s religions, ideologies, nations and classes will in all likelihood disappear along with Homo sapiens. If our successors indeed function on a different level of consciousness (or perhaps possess something beyond consciousness that we cannot even conceive), it seems doubtful that Christianity or Islam will be of interest to them, that their social organisation could be Communist or capitalist, or that their genders could be male or female.\n"
        },
        {
            "time": "30 April 2020 09:15:08",
            "text": "Is there anything more dangerous than dissatisfied and irresponsible gods who don’t know what they want?\n"
        }
    ]
}