{
    "meta_data": {
        "bookId": "5",
        "title": "Siddhartha",
        "authors": [
            "Hermann Hesse"
        ],
        "selfLink": "books\\Hermann Hesse\\Siddhartha\\",
        "thumbnail": "books\\Hermann Hesse\\Siddhartha\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "5 May 2020 14:24:44",
            "text": "Om is the bow, the arrow is soul, The Brahman is the arrow's target, That one should incessantly hit.\n"
        },
        {
            "time": "5 May 2020 14:56:13",
            "text": "At one time, when the two young men had lived among the Samanas for about three years and had shared their exercises, some news, a rumour, a myth reached them after being retold many times: A man had appeared, Gotama by name, the exalted one, the Buddha, he had overcome the suffering of the world in himself and had halted the cycle of rebirths. He was said to wander through the land, teaching, surrounded by disciples, without possession, without home, without a wife, in the yellow cloak of an ascetic, but with a cheerful brow, a man of bliss, and Brahmans and princes would bow down before him and would become his students.\n"
        },
        {
            "time": "5 May 2020 15:08:22",
            "text": "He felt little curiosity for the teachings, he did not believe that they would teach him anything new, but he had, just as Govinda had, heard the contents of this Buddha's teachings again and again, though these reports only represented second- or third-hand information. But attentively he looked at Gotama's head, his shoulders, his feet, his quietly dangling hand, and it seemed to him as if every joint of every finger of this hand was of these teachings, spoke of, breathed of, exhaled the fragrant of, glistened of truth. This man, this Buddha was truthful down to the gesture of his last finger. This man was holy. Never before, Siddhartha had venerated a person so much, never before he had loved a person as much as this one.\n"
        },
        {
            "time": "5 May 2020 15:12:18",
            "text": "I wish that you would go this path up to its end, that you shall find salvation!\"\n"
        },
        {
            "time": "6 May 2020 20:36:40",
            "text": "But now, his liberated eyes stayed on this side, he saw and became aware of the visible, sought to be at home in this world, did not search for the true essence, did not aim at a world beyond. Beautiful was this world, looking at it thus, without searching, thus simply, thus childlike. Beautiful were the moon and the stars, beautiful was the stream and the banks, the forest and the rocks, the goat and the gold-beetle, the flower and the butterfly. Beautiful and lovely it was, thus to walk through the world, thus childlike, thus awoken, thus open to what is near, thus without distrust.\n"
        },
        {
            "time": "6 May 2020 20:39:12",
            "text": "Light and shadow ran through his eyes, stars and moon ran through his heart.\n"
        },
        {
            "time": "6 May 2020 20:39:36",
            "text": "Nice Expression \n"
        },
        {
            "time": "6 May 2020 21:00:26",
            "text": "love can be obtained by begging, buying, receiving it as a gift, finding it in the street, but it cannot be stolen.\n"
        },
        {
            "time": "6 May 2020 21:11:11",
            "text": "When you throw a rock into the water, it will speed on the fastest course to the bottom of the water. This is how it is when Siddhartha has a goal, a resolution. Siddhartha does nothing, he waits, he thinks, he fasts, but he passes through the things of the world like a rock through water, without doing anything, without stirring; he is drawn, he lets himself fall. His goal attracts him, because he doesn't let anything enter his soul which might oppose the goal. This is what Siddhartha has learned among the Samanas. This is what fools call magic and of which they think it would be effected by means of the daemons.\n"
        },
        {
            "time": "6 May 2020 21:11:31",
            "text": "Everyone can perform magic, everyone can reach his goals, if he is able to think, if he is able to wait, if he is able to fast.\"\n"
        },
        {
            "time": "6 May 2020 21:30:34",
            "text": "\"I can think. I can wait. I can fast.\"\n"
        },
        {
            "time": "6 May 2020 21:31:32",
            "text": "\"Writing is good, thinking is better. Being smart is good, being patient is better.\"\n"
        },
        {
            "time": "6 May 2020 21:32:25",
            "text": "he heard a lot and spoke little.\n"
        },
        {
            "time": "6 May 2020 21:33:09",
            "text": "but Siddhartha looked upon all of this as if it was a game, the rules of which he tried hard to learn precisely, but the contents of which did not touch his heart.\n"
        },
        {
            "time": "6 May 2020 21:34:28",
            "text": "that pleasure cannot be be taken without giving pleasure, and that every gesture, every caress, every touch, every look, every spot of the body, however small it was, had its secret, which would bring happiness to those who know about it and unleash it.\n"
        },
        {
            "time": "6 May 2020 21:34:54",
            "text": "She taught him, that lovers must not part from one another after celebrating love, without one admiring the other, without being just as defeated as they have been victorious, so that with none of them should start feeling fed up or bored and get that evil feeling of having abused or having been abused.\n"
        },
        {
            "time": "6 May 2020 21:36:54",
            "text": "Siddhartha surpassed him, the merchant, in calmness and equanimity, and in the art of listening and deeply understanding previously unknown people.\n"
        },
        {
            "time": "6 May 2020 21:37:37",
            "text": "he has that mysterious quality of those people to whom success comes all by itself, whether this may be a good star of his birth, magic, or something he has learned among Samanas. He always seems to be merely playing with out business-affairs, they never fully become a part of him, they never rule over him, he is never afraid of failure, he is never upset by a loss.\"\n"
        },
        {
            "time": "6 May 2020 21:41:17",
            "text": "or whether a shipment of merchandise seemed to have been lost, or a debtor seemed to be unable to pay, Kamaswami could never convince his partner that it would be useful to utter a few words of worry or anger, to have wrinkles on the forehead, to sleep badly.\n"
        },
        {
            "time": "6 May 2020 21:41:24",
            "text": "Siddhartha never listened to Kamaswami's worries and Kamaswami had many worries.\n"
        },
        {
            "time": "6 May 2020 21:43:35",
            "text": "Siddhartha's interest and curiosity was only concerned with the people, whose businesses, crafts, worries, pleasures, and acts of foolishness used to be as alien and distant to him as the moon. However easily he succeeded in talking to all of them, in living with all of them, in learning from all of them, he was still aware that there was something which separated him from them and this separating factor was him being a Samana. He saw mankind going trough life in a childlike or animallike manner, which he loved and also despised at the same time. He saw them toiling, saw them suffering, and becoming gray for the sake of things which seemed to him to entirely unworthy of this price, for money, for little pleasures, for being slightly honoured, he saw them scolding and insulting each other, he saw them complaining about pain at which a Samana would only smile, and suffering because of deprivations which a Samana would not feel.\n"
        },
        {
            "time": "6 May 2020 21:47:48",
            "text": "But again and again, he came back to beautiful Kamala, learned the art of love, practised the cult of lust, in which more than in anything else giving and taking becomes one, chatted with her, learned from her, gave her advice, received advice.\n"
        },
        {
            "time": "6 May 2020 21:58:36",
            "text": "He had been captured by the world, by lust, covetousness, sloth, and finally also by that vice which he had used to despise and mock the most as the most foolish one of all vices: greed.\n"
        },
        {
            "time": "6 May 2020 22:16:03",
            "text": "Siddhartha was deeply shocked. So this was how things were with him, so doomed was he, so much he had lost his way and was forsaken by all knowledge, that he had been able to seek death, that this wish, this wish of a child, had been able to grow in him: to find rest by annihilating his body! What all agony of these recent times, all sobering realizations, all desperation had not brought about, this was brought on by this moment, when the Om entered his consciousness: he became aware of himself in his misery and in his error.\n"
        },
        {
            "time": "6 May 2020 22:23:00",
            "text": "Not eternal is the world of appearances, not eternal, anything but eternal are our garments and the style of our hair, and our hair and bodies themselves. I'm wearing a rich man's clothes, you've seen this quite right. I'm wearing them, because I have been a rich man, and I'm wearing my hair like the worldly and lustful people, for I have been one of them.\"\n"
        },
        {
            "time": "6 May 2020 23:52:21",
            "text": "And how could he not have loved everybody and everything in this moment, in the glorious hour after his wonderful sleep, filled with Om! The enchantment, which had happened inside of him in his sleep and by means of the Om, was this very thing that he loved everything, that he was full of joyful love for everything he saw.\n"
        },
        {
            "time": "7 May 2020 08:02:43",
            "text": "\"It is good,\" he thought, \"to get a taste of everything for oneself, which one needs to know. That lust for the world and riches do not belong to the good things, I have already learned as a child. I have known it for a long time, but I have experienced only now. And now I know it, don't just know it in my memory, but in my eyes, in my heart, in my stomach. Good for me, to know this!\"\n"
        },
        {
            "time": "7 May 2020 08:08:34",
            "text": "But out of all secrets of the river, he today only saw one, this one touched his soul. He saw: this water ran and ran, incessantly it ran, and was nevertheless always there, was always at all times the same and yet new in every moment! Great be he who would grasp this, understand this! He understood and grasped it not, only felt some idea\n"
        },
        {
            "time": "7 May 2020 08:12:44",
            "text": "This was among the ferryman's virtues one of the greatest: like only a few, he knew how to listen. Without him having spoken a word, the speaker sensed how Vasudeva let his words enter his mind, quiet, open, waiting, how he did not lose a single one, awaited not a single one with impatience, did not add his praise or rebuke, was just listening. Siddhartha felt, what a happy fortune it is, to confess to such a listener, to burry in his heart his own life, his own search, his own suffering.\n"
        },
        {
            "time": "7 May 2020 08:18:05",
            "text": "that the river is everywhere at once, at the source and at the mouth, at the waterfall, at the ferry, at the rapids, in the sea, in the mountains, everywhere at once, and that there is only the present time for it, not the shadow of the past, not the shadow of the future?\"\n"
        },
        {
            "time": "7 May 2020 18:32:01",
            "text": "he began the mute struggle of friendliness, the silent war of patience.\n"
        },
        {
            "time": "7 May 2020 18:44:03",
            "text": "This he had learned by the river, this one thing: waiting, having patience, listening attentively.\n"
        },
        {
            "time": "8 May 2020 01:29:59",
            "text": "people, businessmen, warriors, women, these people did not seem alien to him as they used to: he understood them, he understood and shared their life, which was not guided by thoughts and insight, but solely by urges and wishes, he felt like them.\n"
        },
        {
            "time": "8 May 2020 09:42:29",
            "text": "Slowly blossomed, slowly ripened in Siddhartha the realisation, the knowledge, what wisdom actually was, what the goal of his long search was. It was nothing but a readiness of the soul, an ability, a secret art, to think every moment, while living his life, the thought of oneness, to be able to feel and inhale the oneness. Slowly this blossomed in him, was shining back at him from Vasudeva's old, childlike face: harmony, knowledge of the eternal perfection of the world, smiling, oneness.\n"
        },
        {
            "time": "8 May 2020 09:54:39",
            "text": "\"When someone is searching,\" said Siddhartha, \"then it might easily happen that the only thing his eyes still see is that what he searches for, that he is unable to find anything, to let anything enter his mind, because he always thinks of nothing but the object of his search, because he has a goal, because he is obsessed by the goal. Searching means: having a goal. But finding means: being free, being open, having no goal. You, oh venerable one, are perhaps indeed a searcher, because, striving for your goal, there are many things you don't see, which are directly in front of your eyes.\"\n"
        },
        {
            "time": "8 May 2020 09:57:40",
            "text": "wisdom cannot be passed on. Wisdom which a wise man tries to pass on to someone always sounds like foolishness.\"\n"
        },
        {
            "time": "8 May 2020 09:58:03",
            "text": "Knowledge can be conveyed, but not wisdom. It can be found, it can be lived, it is possible to be carried by it, miracles can be performed with it, but it cannot be expressed in words and taught.\n"
        },
        {
            "time": "8 May 2020 09:58:17",
            "text": "The opposite of every truth is just as true!\n"
        },
        {
            "time": "8 May 2020 09:59:31",
            "text": "That's like this: any truth can only be expressed and put into words when it is one-sided. Everything is one-sided which can be thought with thoughts and said with words, it's all one-sided, all just one half, all lacks completeness, roundness, oneness. When the exalted Gotama spoke in his teachings of the world, he had to divide it into Sansara and Nirvana, into deception and truth, into suffering and salvation. It cannot be done differently, there is no other way for him who wants to teach. But the world itself, what exists around us and inside of us, is never one-sided. A person or an act is never entirely Sansara or entirely Nirvana, a person is never entirely holy or entirely sinful. It does really seem like this, because we are subject to deception, as if time was something real. Time is not real, Govinda, I have experienced this often and often again. And if time is not real, then the gap which seems to be between the world and the eternity, between suffering and blissfulness, between evil and good, is also a deception.\"\n"
        },
        {
            "time": "8 May 2020 10:01:28",
            "text": "Therefore, I see whatever exists as good, death is to me like life, sin like holiness, wisdom like foolishness, everything has to be as it is, everything only requires my consent, only my willingness, my loving agreement, to be good for me, to do nothing but work for my benefit, to be unable to ever harm me.\n"
        }
    ]
}