{
    "meta_data": {
        "bookId": "8",
        "title": "Animal Farm",
        "authors": [
            "George Orwell"
        ],
        "selfLink": "books\\George Orwell\\Animal Farm\\",
        "thumbnail": "books\\George Orwell\\Animal Farm\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "11 May 2020 17:28:25",
            "text": "The animals huddled about Clover, not speaking. The knoll where they were lying gave them a wide prospect across the countryside. Most of Animal Farm was within their view-the long pasture stretching down to the main road, the hayfield, the spinney, the drinking pool, the ploughed fields where the young wheat was thick and green,\n"
        },
        {
            "time": "11 May 2020 17:52:00",
            "text": "“I do not understand it. I would not have believed that such things could happen on our farm. It must be due to some fault in ourselves. The solution, as I see it, is to work harder. From now onwards I shall get up a full hour earlier in the mornings.”\n"
        },
        {
            "time": "11 May 2020 17:56:12",
            "text": "though huddling together for warmth-Clover, Muriel, Benjamin,\n"
        },
        {
            "time": "11 May 2020 21:22:35",
            "text": "little whinny of surprise. Finally he said: “I\n"
        },
        {
            "time": "11 May 2020 21:25:58",
            "text": "As Clover looked down the hillside her eyes filled with tears. If she could have spoken her thoughts, it would have been to say that this was not what they had aimed at when they had set themselves years ago to work for the overthrow of the human race. These scenes of terror and slaughter were not what they had looked forward to on that night when old Major first stirred them to rebellion. If she herself had had any picture of the future, it had been of a society of animals set free from hunger and the whip, all equal, each working according to his capacity, the strong protecting the weak, as she had protected the lost brood of ducklings with her foreleg on the night of Major’s speech. Instead-she did not know why-they had come to a time when no one dared speak his mind, when fierce, growling dogs roamed everywhere, and when you had to watch your comrades torn to pieces after confessing to shocking crimes. There was no thought of rebellion or disobedience in her mind. She knew that, even as things were, they were far better off than they had been in the days of Jones, and that before all else it was needful to prevent the return of the human beings. Whatever happened she would remain faithful, work hard, carry out the orders that were given to her, and accept the leadership of Napoleon. But still, it was not for this that she and all the other animals had hoped and toiled. It was not for this that they had built the windmill and faced the bullets of Jones’s gun. Such were her thoughts, though she lacked the words to express them.\n"
        },
        {
            "time": "11 May 2020 21:31:15",
            "text": "“Under the guidance of our Leader, Comrade Napoleon, I have laid five eggs in six days”;\n"
        },
        {
            "time": "11 May 2020 21:31:31",
            "text": "He was always referred to in formal style as “our Leader, Comrade Napoleon,” and this pigs liked to invent for him such titles as Father of All Animals, Terror of Mankind, Protector of the Sheep-fold, Ducklings’ Friend, and the like.\n"
        },
        {
            "time": "11 May 2020 21:32:29",
            "text": "was composed by Minimus and which ran as follows: Friend of fatherless! Fountain of happiness! Lord of the swill-bucket! Oh, how my soul is on Fire when I gaze at thy Calm and commanding eye, Like the sun in the sky, Comrade Napoleon! Thou are the giver of All that thy creatures love, Full belly twice a day, clean straw to roll upon; Every beast great or small Sleeps at peace in his stall, Thou watchest over all, Comrade Napoleon! Had I a sucking-pig, Ere he had grown as big Even as a pint bottle or as a rolling-pin, He should have learned to be Faithful and true to thee, Yes, his first squeak should be “Comrade Napoleon!”\n"
        },
        {
            "time": "11 May 2020 21:43:32",
            "text": "Three days later there was a terrible hullabaloo.\n"
        },
        {
            "time": "11 May 2020 21:55:04",
            "text": "“No animal shall drink alcohol to excess.”\n"
        },
        {
            "time": "11 May 2020 22:06:14",
            "text": "(Squealer always spoke of it as a “readjustment,” never as a “reduction”),\n"
        },
        {
            "time": "11 May 2020 22:07:34",
            "text": "Meanwhile life was hard. The winter was as cold as the last one had been, and food was even shorter. Once again all rations were reduced, except those of the pigs and the dogs. A too rigid equality in rations, Squealer explained, would have been contrary to the principles of Animalism. In any case he had no difficulty in proving to the other animals that they were not in reality short of food, whatever the appearances might be. For the time being, certainly, it had been found necessary to make a readjustment of rations (Squealer always spoke of it as a “readjustment,” never as a “reduction”), but in comparison with the days of Jones, the improvement was enormous. Reading out the figures in a shrill, rapid voice, he proved to them in detail that they had more oats, more hay, more turnips than they had had in Jones’s day, that they worked shorter hours, that their drinking water was of better quality, that they lived longer, that a larger proportion of their young ones survived infancy, and that they had more straw in their stalls and suffered less from fleas. The animals believed every word of it. Truth to tell, Jones and all he stood for had almost faded out of their memories. They knew that life nowadays was harsh and bare, that they were often hungry and often cold, and that theywere usually working when they were not asleep. But doubtless it had been worse in the old days. They were glad to believe so. Besides, in those days they had been slaves and now they were free, and that made all the difference, as Squealer did not fail to point out.\n"
        },
        {
            "time": "11 May 2020 22:11:01",
            "text": "But if there were hardships to be borne, they were partly offset by the fact that life nowadays had a greater dignity than it had had before. There were more songs, more speeches, more processions.\n"
        },
        {
            "time": "11 May 2020 22:32:22",
            "text": "“Four legs good, two legs better! Four legs good, two legs better! Four legs good, two legs better!”\n"
        },
        {
            "time": "11 May 2020 22:33:09",
            "text": "ALL ANIMALS ARE EQUAL BUT SOME ANIMALS ARE MORE EQUAL THAN OTHERS\n"
        }
    ]
}