{
    "meta_data": {
        "bookId": "10",
        "title": "Daily Rituals How Artists Work",
        "authors": [
            "Mason Currey"
        ],
        "selfLink": "books\\Mason Currey\\Daily Rituals How Artists Work\\",
        "thumbnail": "books\\Mason Currey\\Daily Rituals How Artists Work\\thumbnail.jpg"
    },
    "highlights": [
        {
            "time": "14 May 2020 22:12:49",
            "text": "instinctual fusion of discipline and dissipation on which it rests! —THOMAS MANN, Death in Venice\n"
        },
        {
            "time": "14 May 2020 22:14:08",
            "text": "“Tell me what you eat, and I shall tell you what you are,”\n"
        },
        {
            "time": "14 May 2020 22:17:07",
            "text": "one’s daily routine is also a choice, or a whole series of choices. In the right hands, it can be a finely calibrated mechanism for taking advantage of a range of limited resources: time (the most limited resource of all) as well as willpower, self-discipline, optimism.\n"
        },
        {
            "time": "14 May 2020 22:19:38",
            "text": "A solid routine fosters a well-worn groove for one’s mental energies and helps stave off the tyranny of moods.\n"
        },
        {
            "time": "14 May 2020 22:24:47",
            "text": "“Routine, in an intelligent man, is a sign of ambition,” Auden wrote in 1958.\n"
        },
        {
            "time": "21 May 2020 21:30:23",
            "text": "I have kept the candy-store hours all my life. I wake at five in the morning. I get to work as early as I can. I work as long as I can. I do this every day in the week, including holidays. I don’t take vacations voluntarily and I try to do my work even when I’m on vacation. (And even when I’m in the hospital.)\n"
        },
        {
            "time": "21 May 2020 21:31:11",
            "text": "I have kept the candy-store hours all my life. I wake at five in the morning. I get to work as early as I can. I work as long as I can. I do this every day in the week, including holidays. I don’t take vacations voluntarily and I try to do my work even when I’m on vacation. (And even when I’m in the hospital.) In other words, I am still and forever in the candy store. Of course, I’m not waiting on customers; I’m not taking money and making change; I’m not forced to be polite to everyone who comes in (in actual fact, I was never very good at that). I am, instead, doing things I very much want to do—but the schedule is there; the schedule that was ground into me;\n"
        },
        {
            "time": "21 May 2020 21:40:14",
            "text": "“When it all comes together, a creative life has the nourishing power we normally associate with food, love, and faith.”\n"
        },
        {
            "time": "21 May 2020 21:44:40",
            "text": "“The turmoil is invisible.” Georges Simenon (1903-1939) Simenon was one of the most prolific novelists of the twentieth century, publishing 425 books in his career, including more than 200 works of pulp fiction under 16 different pseudonyms, as well as 220 novels in his own name and three volumes of autobiography.\n"
        },
        {
            "time": "21 May 2020 21:44:45",
            "text": "“It will appear like a calm existence,” Kalman said. “The turmoil is invisible.” Georges Simenon (1903-1939) Simenon was one of the most prolific novelists of the twentieth century, publishing 425 books in his career, including more than 200 works of pulp fiction under 16 different pseudonyms, as well as 220 novels in his own name and three volumes of autobiography.\n"
        },
        {
            "time": "21 May 2020 21:44:51",
            "text": "Maira Kalman (b. 1949) The New York illustrator, artist, and designer wakes up early, about 6:00 A.M., makes the bed, and reads the obituaries. Then she goes for a walk with a friend, returns home to eat breakfast, and—if she’s on deadline—heads to her studio, in the same building as her apartment. “I have no phone, or email, no food or anything to distract [in the studio],” she said in a recent e-mail. “I have music and work. There is a green chaise there if a nap is needed. And in the late afternoon it is often needed.” If she is bored being alone in the studio, Kalman will head to a café to listen to the buzz of conversation, take the subway to a museum, or go for a walk through Central Park. “I procrastinate just the right amount,” she said. “There are things which help me get in the mood to work. Cleaning for one. Ironing is great. Taking a walk is always inspiring. Because my work is often based on what I see, I am happy to keep collecting and changing images until the last moment.” Sometimes Kalman doesn’t go into the studio for days at a time. On working days, she is done by 6:00 P.M. She never works at night. “It\n"
        },
        {
            "time": "21 May 2020 21:44:59",
            "text": "“It\n"
        },
        {
            "time": "21 May 2020 21:45:16",
            "text": "“It will appear like a calm existence,” Kalman said. “The turmoil is invisible.”\n"
        },
        {
            "time": "21 May 2020 21:48:51",
            "text": "Murakami wakes at 4:00 A.M. and works for five to six hours straight. In the afternoons he runs or swims (or does both), runs errands, reads, and listens to music; bedtime is 9:00. “I keep to this routine every day without variation,” he told The Paris Review in 2004. “The repetition itself becomes the important thing; it’s a form of mesmerism. I mesmerize myself to reach a deeper state of mind.”\n"
        },
        {
            "time": "21 May 2020 21:51:50",
            "text": "“While I work I leave my body outside the door, the way Moslems take off their shoes before entering the mosque.”\n"
        }
    ]
}